[
    {
        "thread": "  ",
        "comments": [
            "Took me a hot minute to realize this is about voice actors",
            "HOLY SNAP I-",
            "I was so confused at first than realised this wasn't about Charles ",
            "... i didn't get through all of death note because it was so meh, but wasn't light yagami a cringe authoritarian/republican?",
            "Again Japan gets all the fun while we're stuck with Chrisp rat, this movie's gonna put illumination out of business",
            "THE TRAILERa IS SO FUCKING SICK IN JP WHAT",
            "LIGHT FUCKING YAGAMI????",
            "@saitoakirachan Joe Biden is a registered democrat and he eulogized a klan recruiter. Does that make Biden a klan recruiter?  And he doesn ’t have to publicly address something like that since it ’s private families business. And how did he support the guy? In what way? Your evidence is really flimsy",
            "@rebelwithoutacock His brother is a literal neo-nazi white supremacist and Chris Pratt has openly supported his brother before. To be fair, he may have changed in recent times but I don't recall him ever addressing his brother's or his own role in promoting a neo-nazi organization. This also doesn't make him republican but y'know, It's the vibes",
            "ESCUSE ME WHAT-"
        ]
    },
    {
        "thread": "  ",
        "comments": [
            "i love luigi",
            "@shychick-52 dammit stole my idea  \uD83D \uDE02 \uD83D \uDE02",
            "He ’s a  ✨mother ✨",
            "Thiz iz amazing",
            "Bowser looks like a golden retriever that knows it did something wrong and feels guilty about it but also was entirely planning on doing it again",
            "It ’s amazing when you read it with a  very thick Italian accent"
        ]
    },
    {
        "thread": " So since the new trailer implies Luigi will be the sort of damsel in distress being held captive by bowser for a portion the Mario movie while Peach takes a more proactive role joining Mario in his adventure, my prediction is we ’re going to see way more Bowser and Luigi interactions then we ’ve ever seen in the games.  Basically, the Bowser/Luigi shippers are going to have a field day with this movie. ",
        "comments": [
            "WOOOOOO",
            "I said this to my cousin earlier today and they had no idea what the fuck I was talking about I feel Vindicated now",
            "WE ARE",
            "the part where he ripped his mustache hair out was kinky /j",
            "Where ’s that one comic where Mario does the   “So long, ey Bowser! ” line but Bowser mishears it as   “Gay Bowser ” and yells at Luigi   “IT WAS ONE TIME! AND YOU SWORE YOU ’D NEVER TELL YOUR BROTHER ”",
            "I didn't even think of shipping them, brb gonna go feral over this ship",
            "yeah, exactly … wait what? the what shippers??? "
        ]
    },
    {
        "thread": " Been thinking a lot lately about how Mario and Peach might have gotten to know each other better and what subjects could have brought them closer together, so here are several little headcanons I had which I ’ve combined together for this one scene.  \ud83d \ude01      - Whenever Mario mumbles to himself or thinks out loud while working alone on a project, he usually does so in Italian.  - Peach has been fascinated by the language ever since hearing it from the bros and truly finds it beautiful.    - She adores Mario ’s accent and could listen to him speak for hours.  - She learned an Italian word on purpose in the hope of catching Mario ’s attention (and was secretly thrilled when it obviously did).  - She asked for possible lessons because she longs to spend more time with him and figured this was a good way to do exactly that.  - Mario was genuinely impressed that Peach could memorize something she heard only once and was touched by her will to learn.  - When around her, Mario gestures with his hands a lot and unconsciously makes all sorts of small flourishes.^^  - Peach is usually the one who initiates proximity and is just slightly less shy about standing close to him than he is to her.  - Mario ’s patience and natural enthusiasm makes him a great teacher.  - They will soon develop a pattern from this and take to showing new things to one another as a recurring activity.        I love these calm, peaceful moments so much! They ’re among my favorite things to draw.  \ud83e \udd70 ",
        "comments": [
            "that's just adorable",
            "Omg this is litterly so cute !! I love this omgggg  \ud83d \ude2d \ud83d \ude2d",
            "@dragonmonarch12 No need to apologize! And you're welcome!  \ud83e \udd17 I much prefer using real, actual Italian to indicate his nationality (even though I sometimes do make mistakes  \ud83d \ude05) than the awkward  -a  plugged in at the end of certain words. xP",
            "@elitadream  Yeah... Sorry again. I noticed it later. Again, compliments for your Italian. Is perfect! (I'm Italian, so I appreciate the use of true Italian, and not that garbage I see too often... \ud83d \ude12) For third time, great job! \ud83d \ude01 \ud83d \ude01 \ud83d \ude01 \ud83d \ude01 \ud83d \ude0d \ud83d \ude0d \ud83d \ude0d \ud83e \udd29 \ud83e \udd29 \ud83e \udd29",
            "@peppermintfreak You would be right about that! :) The word as she says it is written slightly wrong on purpose.  @dragonmonarch12 If you notice, Mario says the word again in the fifth panel, but with the right spelling this time. I wrote it in cursive to emphasize his accent as he corrects her.  \ud83d \udc81 ‍ ♀ ️",
            "@dragonmonarch12 haha no need to apologise we're just talking is all",
            "I was actually surprised because @elitadream  is pretty good at Italian. You don't know what I've seen... Brrrr! \ud83d \ude16 \ud83d \ude16",
            "@peppermintfreak really? Then sorry! I didn't get it. \ud83d \ude05 \ud83d \ude05 \ud83d \ude05",
            "@dragonmonarch12 i think that was the point, to emphasize how her italian is off thru text",
            "Great try, overall good Italian. Just a thing:  Buongiorno  not  Bonjorno . Apart from that, great comic!"
        ]
    },
    {
        "thread": "  ",
        "comments": [
            "These appeared on my for you page-",
            "this made my giggle",
            "King boo is gonna be pissed",
            "Luigi is Italian he's definitely an otter",
            "poor Luigi",
            "That's what I'm saying.",
            "AhhhhhXD",
            "HAHAHAH",
            "bestie nooo …"
        ]
    },
    {
        "thread": "  ",
        "comments": [
            "and I am here for it.",
            "Phillip out here being the real hero. ",
            "@culturalmochi I love your tags",
            "literally every enemies to lovers ship honestly",
            "Surge and Sonic"
        ]
    },
    {
        "thread": "  GUYS  ",
        "comments": [
            "@maraariana01 ",
            "I'm friends with someone who's part Italian ",
            "Tyyyy for the italians",
            "@lunasilverpelt you like pizza tower here you go",
            "We've cracked the code, everyone!!! Peppino must be the cousin!!!",
            "He's the lost Mario brother....",
            "IM SORRY WHAT",
            "Italians with anxiety ",
            "it brings-a a tear to my-a eye",
            "dear god",
            "@possiblymawsome ",
            "NO WAY  \ud83d \udca5 \ud83d \udca5 \ud83d \udca5 \ud83d \udca5 \ud83d \udca5 \ud83d \udca5 \ud83d \udca5"
        ]
    },
    {
        "thread": " Oh, also they need to let Peach go ham on Bowser ’s minions just like in the Super Mario comic in the 90s. That ’ll be so cool if they did. ",
        "comments": [
            "Special delivery! PAIN ",
            "Please",
            "everyone forgets super princess peach",
            "Look at the little brother fist bump  \ud83e \udd7a",
            "They need to put Luigi in a dress like they did before ",
            "The expression on that pic of Mario being hit by a bullet bill is so good Omfg I need that skill if expressions in my art",
            "I think it would be awesome if she did end up getting captured, only to slap the shit out of Bowser's forces and leave.",
            "You know, it makes way more sense for Luigi to be the one in distress because it's a stronger motivation for Mario to be like  oh no, he took my brother  than  oh no, he took a princess I barely know ",
            "This is the girl boss we ’ve deserved since the creation of super Mario",
            "The first image of peach. I love that she's a halberd girl."
        ]
    },
    {
        "thread": "  they make me SICK!!  ",
        "comments": [
            "EHEHEHEHEHHOHOHOHOO",
            "I don ’t know how I got here, but I ’m okay with it",
            "Huh … wish I didn ’t learn new things about myself every time I opened this damn app ",
            "I ship this and non of you can stop me"
        ]
    },
    {
        "thread": " Sorry not sorry for my excitement of this movie   Anyways I find it hilarious that Mario has no idea where Luigi is and he ’s just in lala land half of the time with toad  \ud83d \udc80 ",
        "comments": [
            "chris pratt is the opposite of 'lol so randum'",
            "Every single fandom has this dynamic and you can ’t prove this wrong",
            "I ’m laughing my ass off  \ud83d \ude02",
            "@blue-annie920 hehe~ like what",
            "This is a masterpiece",
            "no i am vommitting from how hard im laughing WHAT IS THIS TONOWARI wHAT IS THIS",
            "I have been listening to this for 30 minutes.",
            "I missed this sound"
        ]
    },
    {
        "thread": "  Your honour, they are lovers.  ",
        "comments": [
            "IT JUST KEEPS GETTING FUCKING BETTER",
            "@gorilladude32 they are gay because there is no heterosexual explanation for that scene in the trailer",
            "True",
            "Never die  \ud83d \udd25 \ud83d \udd25",
            "Anyway",
            "Why yes, I am for real. Been shipping them since 2017-2018 because they're awesome.  \ud83d \ude0c",
            "Are you fr? Why is everything about them on my fyp, what the actual hell is going on",
            "I wish that Luigi and Bowser could eat a room-sized pizza together by swimming through it with their mouths open like in the Mario Party minigame eatsa pizza. & then kiss or whatever",
            "@gorilladude32 LMAO FUDGE?? Shut upp they can be gay if they want to be",
            "@gorilladude32 please swear I need you to swear lmao",
            "@gorilladude32 bowser and luigi are having hot gay sex while you start arguments on the internet",
            "@gorilladude32 Daisy is a lesbian",
            "@gorilladude32 shut the fuck up"
        ]
    },
    {
        "thread": "  Wow, you guys blew me away!     The response to my last Mario post was so immediate and so overwhelming that I just HAD to give you more!   This time with some hugs, because I committed a  crime   by not including some brotherly hugs in the last post … and some more angst! Because too many people walked away from that post unscathed! :D   Also I apologize if not being able to read what the brothers are saying is a bit annoying.. I liked the idea that during tender moments or casual conversation, Mario and Luigi speak in Italian with each other. And I didn ’t want that aspect to be lost in my work by just writing in English.. (aside from the last one lol-)   But hey I provided some  Italian to English translations at least!  ",
        "comments": [
            "I would love to see a drawing fo them just testing out what happens if they fart into the fire from the flower lol",
            "Italian their native language?",
            "TESYESYESYESYES THIS IS THEIR DYNAMIC !!! I LOVE THEM SM ",
            "@factual-fantasy I love it mostly because you make some scenes of them actually speaking in Italian and as an Italian girl i feel appreciated thank you factual  Btw here is a little heart for ya  \ud83d \udc9c",
            "This account has made me love Mario ’s character and it ’s taking everything in me not to spam like \ud83d \ude2d",
            "lmao the last one, of course a couple of young guys who work with PLUMBING all day would revert to the Eternal Joke...",
            "This brings me smile"
        ]
    },
    {
        "thread": " <figure class= tmblr-full  data-orig-height= 3240  data-orig-width= 5760 ><img src= https://64.media.tumblr.com/44d2f8f44a9b8a0d6ca7251fab4a220c/32987c046587a93c-ab/s540x810/d61b07e36028a594e1c8bdff60280e946a8d587d.png  data-orig-height= 3240  data-orig-width= 5760 ></figure> Ok hear me out-  ",
        "comments": [
            "Wtf--- Mario, you know you shouldn't stole flowers!",
            "I ’m listening ",
            "Continue . . .",
            " \ud83d \udc42",
            "awww",
            "You have my full undivided attention",
            "YES! WHY IS EVERYBODY FINE WITH BEAUTY AND THE BEAST AND THEN I SAY BOWSER ×LUIGI SHOULD HAPPEN AND THEY SAY  EWW, GROSS?!?  They say it's different because Beast was actually a human but hey... Belle didn't know that. She was ready to get down with beastiality.  \ud83d \ude36 SO IF THAT WAS FINE, THIS IS FINE. ",
            "I- is bowser gonna be ugly...",
            "I ’M LISTENING.",
            "@i-ate-victor-hugos-brain"
        ]
    },
    {
        "thread": " <h1>i dare you. i fucking dare you. to draw bowuigi with their ACTUAL size difference. </h1><div class= npf_row ><figure class= tmblr-full  data-orig-height= 900  data-orig-width= 1600 ><img src= https://64.media.tumblr.com/1e6920d5f8551b4744571199515ed685/996d53b8682d8998-7f/s640x960/80732763d21ee0e62cc60977cdd33f979916e8f6.png  data-orig-height= 900  data-orig-width= 1600  srcset= https://64.media.tumblr.com/1e6920d5f8551b4744571199515ed685/996d53b8682d8998-7f/s75x75_c1/74bc93586c2182c91286696b43a7722cd0906467.png 75w, https://64.media.tumblr.com/1e6920d5f8551b4744571199515ed685/996d53b8682d8998-7f/s100x200/40f466fd7f438770a488ab30f7aafc16a95101a4.png 100w, https://64.media.tumblr.com/1e6920d5f8551b4744571199515ed685/996d53b8682d8998-7f/s250x400/bb32b583e74161db2a631355ab1cc606db10174d.png 250w, https://64.media.tumblr.com/1e6920d5f8551b4744571199515ed685/996d53b8682d8998-7f/s400x600/6ca5c320592083491459b203d7fd2869d7dd4df1.png 400w, https://64.media.tumblr.com/1e6920d5f8551b4744571199515ed685/996d53b8682d8998-7f/s500x750/00afd72e54a073e37782a24cd3b3f6a976c19804.png 500w, https://64.media.tumblr.com/1e6920d5f8551b4744571199515ed685/996d53b8682d8998-7f/s540x810/faf7e05ca4db88810fe346383965af45b84a581c.png 540w, https://64.media.tumblr.com/1e6920d5f8551b4744571199515ed685/996d53b8682d8998-7f/s640x960/80732763d21ee0e62cc60977cdd33f979916e8f6.png 640w, https://64.media.tumblr.com/1e6920d5f8551b4744571199515ed685/996d53b8682d8998-7f/s1280x1920/f2237807b0f14cd6c5613d5ece1dd3ed122f58ba.png 1280w, https://64.media.tumblr.com/1e6920d5f8551b4744571199515ed685/996d53b8682d8998-7f/s2048x3072/25325ac581fd15b8de473e4b3cff35fbc7dca93e.png 1600w  sizes= (max-width: 1280px) 100vw, 1280px ></figure></div> this is straight from the odyssey.   Edit: yeah yeah, they change size every game, whatever. MY POINT STILL STANDS. BIG MAN BOWSER. GIMME.   ",
        "comments": [
            "That would be giant/tiny.",
            "These two remind me of fucking Journey to the West with Demon Bull King and Iron Fan they even have Junior as their Redboy ",
            "With the slick hair from the game too! Thanks.",
            "Why am I obsessed with this?!",
            "@angelxd-3303 GIMME",
            "*sheepishly raises hand* And if I did it?? Do I get a cookie for participation?",
            "sh- I can't draw that size difference-",
            "Give him some chunk.",
            "IKR it's like i know you can draw him buff and thicc. Just size him up a lil. C'mon. You know you want to. ",
            "I've seen so much of buff bowser, that I think this would be very in the scope of possibility",
            "YES!!!",
            "@parkerthejester i mean Mario games are older than Shrek so...  \ud83d \udc40 \ud83d \udc40 \ud83d \udc40",
            "Lorge",
            "I have little interest in watching the new Mario movie, just because the voice and everything else, it makes me want to scream. But …given Chris Pratt ’s blatant homophobia, I am loving this Bowser/Luigi thing. It ’s hilarious ",
            "*Size diff fic, Slash, Rated M, 2,000+ words, Luigi/bowser, 10+ tags and on ao3",
            "@hurtyknees Ofc \ud83d \ude4f",
            "@thegayjokester ...tag me when u do it plz"
        ]
    },
    {
        "thread": " theyre vibin ",
        "comments": [
            "when I say I cackled",
            "@lazyartist1987 Mario: yup",
            "No, no you know what you said.",
            "Bootiful",
            "r/maliciouscompliance",
            "Yes he did.",
            "@forgot-the-vanilla this is tumblr."
        ]
    },
    {
        "thread": " <div class= npf_row ><figure class= tmblr-full  data-orig-height= 311  data-orig-width= 394 ><img src= https://64.media.tumblr.com/a5275c983564b964dee815a973bd4198/5b4a4c23ef73b9ee-f0/s640x960/3165d06af40235f6682a5c98ee8c85975c3412b6.jpg  data-orig-height= 311  data-orig-width= 394  srcset= https://64.media.tumblr.com/a5275c983564b964dee815a973bd4198/5b4a4c23ef73b9ee-f0/s75x75_c1/1584ebca0d73f5522103616924c8faa5984ed639.jpg 75w, https://64.media.tumblr.com/a5275c983564b964dee815a973bd4198/5b4a4c23ef73b9ee-f0/s100x200/f63bb2d39354285e03d6b867c780dee0525786c8.jpg 100w, https://64.media.tumblr.com/a5275c983564b964dee815a973bd4198/5b4a4c23ef73b9ee-f0/s250x400/afc9e0c3232af191226cd1c54f3556b599a1e985.jpg 250w, https://64.media.tumblr.com/a5275c983564b964dee815a973bd4198/5b4a4c23ef73b9ee-f0/s400x600/d7ae3758626e0eedca68fa2b3928c29a25d79799.jpg 394w  sizes= (max-width: 394px) 100vw, 394px ></figure></div><div class= npf_row ><figure class= tmblr-full  data-orig-height= 604  data-orig-width= 642 ><img src= https://64.media.tumblr.com/9f21033ebdb860abbc405108200af162/5b4a4c23ef73b9ee-02/s640x960/a44003dbba6043e54395e99ad9f4653fe6006c5a.jpg  data-orig-height= 604  data-orig-width= 642  srcset= https://64.media.tumblr.com/9f21033ebdb860abbc405108200af162/5b4a4c23ef73b9ee-02/s75x75_c1/c3ed0d3eeffea89f2d8efc381874bfcbf501ee9a.jpg 75w, https://64.media.tumblr.com/9f21033ebdb860abbc405108200af162/5b4a4c23ef73b9ee-02/s100x200/3cfa4a698854f4da04211e099bd02a242bdde5b2.jpg 100w, https://64.media.tumblr.com/9f21033ebdb860abbc405108200af162/5b4a4c23ef73b9ee-02/s250x400/62f18414be29c9692ccd7be42a9d46888379bbe3.jpg 250w, https://64.media.tumblr.com/9f21033ebdb860abbc405108200af162/5b4a4c23ef73b9ee-02/s400x600/e6a0392fdeaa5a376d9d754780bbf1fdf53cda29.jpg 400w, https://64.media.tumblr.com/9f21033ebdb860abbc405108200af162/5b4a4c23ef73b9ee-02/s500x750/c8a8e1855cb354c011850bc79b058f6cf0b6d4ed.jpg 500w, https://64.media.tumblr.com/9f21033ebdb860abbc405108200af162/5b4a4c23ef73b9ee-02/s540x810/1e897fb92e69c9370729b282fb8873e418e736fb.jpg 540w, https://64.media.tumblr.com/9f21033ebdb860abbc405108200af162/5b4a4c23ef73b9ee-02/s640x960/a44003dbba6043e54395e99ad9f4653fe6006c5a.jpg 640w, https://64.media.tumblr.com/9f21033ebdb860abbc405108200af162/5b4a4c23ef73b9ee-02/s1280x1920/d640e2443a34ee4c00989f5b4394c58b31f2a44d.jpg 642w  sizes= (max-width: 642px) 100vw, 642px ></figure></div><div class= npf_row ><figure class= tmblr-full  data-orig-height= 666  data-orig-width= 822 ><img src= https://64.media.tumblr.com/355c494b5fdddf9b14679eba47763717/5b4a4c23ef73b9ee-b5/s640x960/694cc2d7b35551ed1500ec26eadcd64b84e307b8.jpg  data-orig-height= 666  data-orig-width= 822  srcset= https://64.media.tumblr.com/355c494b5fdddf9b14679eba47763717/5b4a4c23ef73b9ee-b5/s75x75_c1/f2f8eb4e02e85b6bee6b50e20c2623f729906361.jpg 75w, https://64.media.tumblr.com/355c494b5fdddf9b14679eba47763717/5b4a4c23ef73b9ee-b5/s100x200/1ea79a50cffa4a11c667cb41af9fcf677648ea2e.jpg 100w, https://64.media.tumblr.com/355c494b5fdddf9b14679eba47763717/5b4a4c23ef73b9ee-b5/s250x400/8b13bb9882a0ff7f6031d74939c631ebc5d88733.jpg 250w, https://64.media.tumblr.com/355c494b5fdddf9b14679eba47763717/5b4a4c23ef73b9ee-b5/s400x600/551c39329736d361ae1baf18084f230fd8c8d858.jpg 400w, https://64.media.tumblr.com/355c494b5fdddf9b14679eba47763717/5b4a4c23ef73b9ee-b5/s500x750/4621cd23b6e33bdb1889caf895a704d23a851ce9.jpg 500w, https://64.media.tumblr.com/355c494b5fdddf9b14679eba47763717/5b4a4c23ef73b9ee-b5/s540x810/93307619b3b5e4296d076486f2b098e33e365696.jpg 540w, https://64.media.tumblr.com/355c494b5fdddf9b14679eba47763717/5b4a4c23ef73b9ee-b5/s640x960/694cc2d7b35551ed1500ec26eadcd64b84e307b8.jpg 640w, https://64.media.tumblr.com/355c494b5fdddf9b14679eba47763717/5b4a4c23ef73b9ee-b5/s1280x1920/a13c355ab3043966b8c4f54fe5f344929802fc54.jpg 822w  sizes= (max-width: 822px) 100vw, 822px ></figure></div> Look at her  ",
        "comments": [
            "WE COULD OF HAD MARIO IN A WIG, HIS WEAVE COULD HAVE BEEN LITERALLY SNACKED. missed opitunity for drag race jokes",
            "MARIO TRANSGENDER REAL?????",
            "Please don ’t look at my name",
            "In what way do you mean shank",
            "Super Mario Odyssey, but the gag is, at the wedding scene in the church on the moon, Peach in the wedding dress POOF! magically transforms into Mario in the wedding dress, ready to shank Bowser's ass one last time in the final battle. "
        ]
    },
    {
        "thread": "  A slight break from my norm. An early Christmas present WIP for <a class= tumblelog  href= https://tmblr.co/MsTgxE87lkd1jMrzLE6Vesg >@duxinteritio  (go check out her bowxluigi fic and other original writings)  <div class= npf_row ><figure class= tmblr-full  data-orig-height= 2048  data-orig-width= 1583 ><img src= https://64.media.tumblr.com/e630ba49c4b922c69a8300fb34eb2657/ece40986ea211c55-f4/s640x960/4d0e021bfba446950350d0ba557f04e4de73b9dc.jpg  data-orig-height= 2048  data-orig-width= 1583  srcset= https://64.media.tumblr.com/e630ba49c4b922c69a8300fb34eb2657/ece40986ea211c55-f4/s75x75_c1/350c7996f429d07104bbd8fdd5b38ed067a2edef.jpg 75w, https://64.media.tumblr.com/e630ba49c4b922c69a8300fb34eb2657/ece40986ea211c55-f4/s100x200/30e4005410e190c642b4866ef4a4c3089625dca4.jpg 100w, https://64.media.tumblr.com/e630ba49c4b922c69a8300fb34eb2657/ece40986ea211c55-f4/s250x400/8870dadce225f0cec8ed9e2d742b6573fa31e67f.jpg 250w, https://64.media.tumblr.com/e630ba49c4b922c69a8300fb34eb2657/ece40986ea211c55-f4/s400x600/d053bd1461c977f8b825614c740bf59054c116d7.jpg 400w, https://64.media.tumblr.com/e630ba49c4b922c69a8300fb34eb2657/ece40986ea211c55-f4/s500x750/b83081498aeb95b5e15709ad82acfcd068cd9f40.jpg 500w, https://64.media.tumblr.com/e630ba49c4b922c69a8300fb34eb2657/ece40986ea211c55-f4/s540x810/0ab56a115f221c492202ba730bd31951086bb319.jpg 540w, https://64.media.tumblr.com/e630ba49c4b922c69a8300fb34eb2657/ece40986ea211c55-f4/s640x960/4d0e021bfba446950350d0ba557f04e4de73b9dc.jpg 640w, https://64.media.tumblr.com/e630ba49c4b922c69a8300fb34eb2657/ece40986ea211c55-f4/s1280x1920/c5de85f388d276cb1c2a9b28584b97f6debe9035.jpg 1280w, https://64.media.tumblr.com/e630ba49c4b922c69a8300fb34eb2657/ece40986ea211c55-f4/s2048x3072/eef37e25fa59c4d63790666a756435d5d6410d53.jpg 1583w  sizes= (max-width: 1280px) 100vw, 1280px ></figure></div> ",
        "comments": [
            "My wife and I think he would be reluctantly supportive if only it meant Bowser stops stealing peach. @achickennamedcheese @ieatchildrenstoes1234",
            "They just had se-... Session of cuddling.",
            "how am I ony just hearing about this",
            "OKay but why is this such a good ship?",
            "How do you think Mario would react \ud83e \udd27",
            "Holy wow!!!!  \ud83d \ude32  \ud83d \ude2e you guys! 10,000? Hits? On this? I'm gonna cry  \ud83d \ude22  \ud83d \ude2d . You are so good for my Ego!!!!!!!! ",
            "Luigi:  “Brother, you know i ’m a lover not a fighter ”"
        ]
    },
    {
        "thread": " <div class= npf_row ><figure class= tmblr-full  data-orig-height= 467  data-orig-width= 400 ><img src= https://64.media.tumblr.com/856eb47c93acf9edb56279d2e6f827f0/5de6fc389eebad0b-b4/s640x960/5deec3569e04d675aa423a3c4bfadff9dd694155.png  data-orig-height= 467  data-orig-width= 400  srcset= https://64.media.tumblr.com/856eb47c93acf9edb56279d2e6f827f0/5de6fc389eebad0b-b4/s75x75_c1/be90ed4067dfff4744e756bd892770187c45e362.png 75w, https://64.media.tumblr.com/856eb47c93acf9edb56279d2e6f827f0/5de6fc389eebad0b-b4/s100x200/2f5f9a7a82d97ef572f4509cb980c738c91b9d80.png 100w, https://64.media.tumblr.com/856eb47c93acf9edb56279d2e6f827f0/5de6fc389eebad0b-b4/s250x400/2cb3e39bd44dd0d71e0a66ef1b976cb4da5325e5.png 250w, https://64.media.tumblr.com/856eb47c93acf9edb56279d2e6f827f0/5de6fc389eebad0b-b4/s400x600/00070bb31c9004f9141714668fdca7f8f5d8604e.png 400w  sizes= (max-width: 400px) 100vw, 400px ></figure></div> PLEASE BOWSER AND LUIGI DUET PLEASE BOWSER AND LUIGI DUET PLEASE BOWSER AND LUIGI DUET PLEASE BOWSER AND LUIGI DUET PLEASE BOWSER AND LUIGI DUET PLEASE BOWSER AND LUIGI DUET PLEASE BOWSER AND LUIGI DUET PLEASE BOWSER AND LUIGI DUET   ",
        "comments": [
            "@morkify HEHEHHEE IKR",
            "ohhhh this would be so cool",
            "He has a piano in one of the trailers",
            "Really, it wil be perfect thing in this world  \ud83e \udd0c",
            "*Summons the creators.*   *Turns into Karen*   Imma speak to the FBI if this doesn't happen.",
            "THIS WOULD BE SO AWESOME, ESPECIALLY IF IT WAS LUIGI AND BOWSER ",
            "This would be awesome!  ",
            "@givebeeffrogs yes, yes, YES!!!",
            "PLEASSSEEEEEE",
            "idk nothing about mario whats happening",
            "*bangs card on counter aggressively* TAKE IT NOW, I WANNA SEE THIS  \ud83d \ude4f \ud83d \ude4f",
            " “Are we gonna have a problem? ” *Candy Store plays*",
            "PLEASE PLEASE PLEASE PLEASE PLEASE",
            "I just imagine him singing a Beauty and the Beast song",
            "YES YES YES!",
            "@atbussysparks YES!",
            "OH MY GOD THIS IS NOT A DRILL I REPEAT THIS IS NOT A DRILL",
            "No! ",
            "Saxboom secne?"
        ]
    },
    {
        "thread": " im banking on the luigi ’s b plot being like beauty and the beast. Luigi fixing bowser and them bonding. By the end mario is like Ive come to save you! Then it cuts to luigi and bowser making friendship bracelets and making out ",
        "comments": [
            "I want that... but Nintendo is too big of a company to include gay people in a major movie.",
            "I hope they kiss in the movie",
            "I hope so",
            "God, that's so fucking weird.",
            "@jonadaylight ngl I forgot about this but you made me smile so thank you  \ud83d \ude0a",
            "@stationerykid  You are one of those people that make the Internet wholesome and lovely.",
            "Yes! This can be a great redemption for Bowser in this movie and the sequels can have different villains. After all, he is friendly around Mario and his brother and friends during the sports and kart games, sometimes the party games sometimes.",
            "This fandom getting me too excited for this film, like I'm actually expecting an enemies to lovers",
            "I can't wait to see the movie ヾ ⁠( ⁠   ͝ ⁠ ° ⁠   ͜ ⁠ ʖ ͡ ⁠ ° ⁠) ⁠ ノ",
            "that last part is sending mixed signals /j",
            "Good work!",
            "@i-ate-victor-hugos-brain",
            "Omg so gay",
            "@trash-user ",
            "YES I WANT THIS",
            " “Making out ”  W H A T-",
            "PLEASE"
        ]
    },
    {
        "thread": " <figure data-orig-width= 5760  data-orig-height= 3240  class= tmblr-full ><img src= https://64.media.tumblr.com/f2ac7cf039d6478d3058272c29af82c2/92a40a73efc68c20-7e/s540x810/bddbdb638dbf64c43527433729357b21fc06d6e4.png  alt= image  data-orig-width= 5760  data-orig-height= 3240 ></figure><figure data-orig-width= 5760  data-orig-height= 3240  class= tmblr-full ><img src= https://64.media.tumblr.com/dc5ae021e256a9b6fbe66b72e4b9b598/92a40a73efc68c20-ff/s540x810/728dfbaba877c83ecc251113d4facc81a27134c0.png  alt= image  data-orig-width= 5760  data-orig-height= 3240 ></figure><figure data-orig-width= 5760  data-orig-height= 3240  class= tmblr-full ><img src= https://64.media.tumblr.com/e420523744268122297647dd2e96e97a/92a40a73efc68c20-49/s540x810/827a2d6c75983a59a5d19c0252dbe74e43d79932.png  alt= image  data-orig-width= 5760  data-orig-height= 3240 ></figure><figure data-orig-width= 5760  data-orig-height= 3240  class= tmblr-full ><img src= https://64.media.tumblr.com/b640f57fd4480cefb9977d26c79bc6f9/92a40a73efc68c20-6a/s540x810/b291ce7c278c927f29210bb0b19b22070216e38c.png  alt= image  data-orig-width= 5760  data-orig-height= 3240 ></figure><figure data-orig-width= 5760  data-orig-height= 3240  class= tmblr-full ><img src= https://64.media.tumblr.com/f1ab42c1b744219673a79ef2d5d457a6/92a40a73efc68c20-15/s540x810/d9fec9f3bfa2e66eef1b67c6a2a8b6bcbf47d452.png  alt= image  data-orig-width= 5760  data-orig-height= 3240 ></figure><figure data-orig-width= 5760  data-orig-height= 3240  class= tmblr-full ><img src= https://64.media.tumblr.com/671fceb507000b9b8c7f93d0cb27e243/92a40a73efc68c20-6b/s540x810/a158bf22f47f4b26d7ec8f338fd4a4ca1de12513.png  alt= image  data-orig-width= 5760  data-orig-height= 3240 ></figure><figure data-orig-width= 5760  data-orig-height= 3240  class= tmblr-full ><img src= https://64.media.tumblr.com/8f96b26d29eadaa37475ff3842799237/92a40a73efc68c20-57/s540x810/140ba5295409028d08c041944fea2820b273c11f.png  alt= image  data-orig-width= 5760  data-orig-height= 3240 ></figure><figure data-orig-width= 5760  data-orig-height= 3240  class= tmblr-full ><img src= https://64.media.tumblr.com/2b0ddcc487c458672a0c9034e58bda5c/92a40a73efc68c20-1e/s540x810/a2a1d6676e895629ac8df60fc490cdd270ac9ab3.png  alt= image  data-orig-width= 5760  data-orig-height= 3240 ></figure> I have not consumed like ANY canon Mario content so sorry if someone is grossly out of character- BUT BOWUIGI HAS ITS HOOKS IN ME  I HAVE NEVER BEEN PARTICULARLY INTERESTED IN SUPER MARIO UNTIL NOW-  Bonus! <figure data-orig-width= 556  data-orig-height= 404  class= tmblr-full ><img src= https://64.media.tumblr.com/a9ec67e90ac9982c1532bb85da1e0f24/92a40a73efc68c20-d1/s540x810/81c302c51d6bbb2346e4a95379da4647f48932e3.png  alt= image  data-orig-width= 556  data-orig-height= 404 ></figure> They had a good time :D  ",
        "comments": [
            " Mario are you homophobic ",
            "Bowuigi has me on a super mario chokehold i swear",
            "MR MARIO MAN. Shhhhhhh it ’s fine. No issue ",
            "@tenkodraxon Tbf Bowser probably started dating Luigi just to mess with Mario but like any half way decent rom-com he ends up falling for him even though that was rule 1 on what not to do.",
            "Luigi heritage post"
        ]
    },
    {
        "thread": " Unused props from the production of the 1993 Super Mario Bros. movie that painted President Koopa as a religious leader in addition to his political role. In the finished cut of the movie, these props are not used but picket signs with related slogans can be seen in the background of some scenes.  <small><sub><a href= http://www.suppermariobroth.com/ >Main Blog  | <a href= https://twitter.com/MarioBrothBlog >Twitter  | <a href= https://www.patreon.com/suppermariobroth >Patreon  | <a href= https://smallmariofindings.tumblr.com/ >Small Findings  | Source: <a href= https://twitter.com/smbmovie/status/1637207703511605251 >twitter.com user  “smbmovie ” </sub></small>   ",
        "comments": [
            "If you have only heard about this film and have never sat down to watch it, I really encourage it because it is a unique opportunity to experience the most overwhelming wave of  Man, They Really Weren't Kidding  for an hour and forty-four minutes",
            "'#akoopalyptic cults'",
            "We need these made into some sort of free printouts to distribute ",
            "The Last of Us, 2023. "
        ]
    },
    {
        "thread": "   “Take care of yourself, buddy … ”     “Thanks, bud. ”   <b><small> ↳ :  バ イ オ ハ ザ ー ド RESIDENT EVIL 4 R E M A K E</small></b><small>    </small> ",
        "comments": [
            "HEWIE MY BELOVED! ",
            "HEWIE!!!",
            "Hey, it's that dog",
            "I'm gonna cry  \ud83d \ude2d I missed the dog and couldn't save him! Where do you find this good boy?"
        ]
    },
    {
        "thread": " <div class= npf_row ><figure class= tmblr-full  data-orig-height= 2048  data-orig-width= 821 ><img src= https://64.media.tumblr.com/db4bfd169bbb03e2a8f8b70dcc7a5bb0/8abcc4b3cdec2705-e4/s640x960/774007a10be8145d29ba0f792f335a6a7b4db5bb.jpg  data-orig-height= 2048  data-orig-width= 821  srcset= https://64.media.tumblr.com/db4bfd169bbb03e2a8f8b70dcc7a5bb0/8abcc4b3cdec2705-e4/s75x75_c1/22bde3be7a5d409c5e42ef49dbdbd193aa79e614.jpg 75w, https://64.media.tumblr.com/db4bfd169bbb03e2a8f8b70dcc7a5bb0/8abcc4b3cdec2705-e4/s100x200/926ead466ab7ee658526bac0e9f257789c04471f.jpg 80w, https://64.media.tumblr.com/db4bfd169bbb03e2a8f8b70dcc7a5bb0/8abcc4b3cdec2705-e4/s250x400/8970766da49f19fa972b3949d005c95f823d327c.jpg 160w, https://64.media.tumblr.com/db4bfd169bbb03e2a8f8b70dcc7a5bb0/8abcc4b3cdec2705-e4/s400x600/159ed9e524d9b510dab4b5f625f87b242f6dc403.jpg 241w, https://64.media.tumblr.com/db4bfd169bbb03e2a8f8b70dcc7a5bb0/8abcc4b3cdec2705-e4/s500x750/a993365561c4376a2d6cc4ddf5ddce627d310261.jpg 301w, https://64.media.tumblr.com/db4bfd169bbb03e2a8f8b70dcc7a5bb0/8abcc4b3cdec2705-e4/s540x810/692cb14dc87287fe7a77c684819c5525e51e06aa.jpg 325w, https://64.media.tumblr.com/db4bfd169bbb03e2a8f8b70dcc7a5bb0/8abcc4b3cdec2705-e4/s640x960/774007a10be8145d29ba0f792f335a6a7b4db5bb.jpg 385w, https://64.media.tumblr.com/db4bfd169bbb03e2a8f8b70dcc7a5bb0/8abcc4b3cdec2705-e4/s1280x1920/1e58bbc2131487dae0fa00fa791f2af01f15fe65.jpg 770w, https://64.media.tumblr.com/db4bfd169bbb03e2a8f8b70dcc7a5bb0/8abcc4b3cdec2705-e4/s2048x3072/9a7f9aeaeccc00b3ea934d7c5d69895dc7b309a0.jpg 821w  sizes= (max-width: 821px) 100vw, 821px ></figure></div> long time no see  \ud83e \udd40  and happy re4r day!!   ",
        "comments": [
            " \ud83d \ude33",
            "Lucky maid  \ud83d \ude02",
            "Lucky maid.... Now out of the way, it's my turn  \ud83d \ude06 \ud83d \ude06 \ud83d \ude06",
            "What deal?",
            "I think Lady D feels guilty for scratching the maid's face, and that's why she is so harsh towards the maid for falling for Bela."
        ]
    },
    {
        "thread": " <div class= npf_row ><figure class= tmblr-full  data-orig-height= 480  data-orig-width= 705 ><img src= https://64.media.tumblr.com/988431b3fb004d4d2e33d35dfd03f9a3/9812969c49c1c550-c4/s640x960/a92794028d144a13be9e90b2bfc80b8e8e989b3d.png  data-orig-height= 480  data-orig-width= 705  srcset= https://64.media.tumblr.com/988431b3fb004d4d2e33d35dfd03f9a3/9812969c49c1c550-c4/s75x75_c1/9e529a6ec9d74e394a6bdc94dfdba6db91e6afe7.png 75w, https://64.media.tumblr.com/988431b3fb004d4d2e33d35dfd03f9a3/9812969c49c1c550-c4/s100x200/b8253b677af78e11f602c9f7971cbd5012c530fd.png 100w, https://64.media.tumblr.com/988431b3fb004d4d2e33d35dfd03f9a3/9812969c49c1c550-c4/s250x400/5a7cd861745d149990d30f9d07bc681e3223e802.png 250w, https://64.media.tumblr.com/988431b3fb004d4d2e33d35dfd03f9a3/9812969c49c1c550-c4/s400x600/0572801148955330581b04972fa170aaccf53770.png 400w, https://64.media.tumblr.com/988431b3fb004d4d2e33d35dfd03f9a3/9812969c49c1c550-c4/s500x750/3b99cec05addd15623c04fd96035b170972865e3.png 500w, https://64.media.tumblr.com/988431b3fb004d4d2e33d35dfd03f9a3/9812969c49c1c550-c4/s540x810/f77b83477021726503b3bab14a6a1ae3c68bacd5.png 540w, https://64.media.tumblr.com/988431b3fb004d4d2e33d35dfd03f9a3/9812969c49c1c550-c4/s640x960/a92794028d144a13be9e90b2bfc80b8e8e989b3d.png 640w, https://64.media.tumblr.com/988431b3fb004d4d2e33d35dfd03f9a3/9812969c49c1c550-c4/s1280x1920/c1fe52ea7af77c62b77b0cee1df3d55f626dff3b.png 705w  sizes= (max-width: 705px) 100vw, 705px ></figure></div><div class= npf_row ><figure class= tmblr-full  data-orig-height= 281  data-orig-width= 500 ><img src= https://64.media.tumblr.com/f77b0a7dc755df6fb9f55b484240d1b1/9812969c49c1c550-45/s640x960/bdcfb2ea998456331ad35da6ceb1814c37af7b4f.jpg  data-orig-height= 281  data-orig-width= 500  srcset= https://64.media.tumblr.com/f77b0a7dc755df6fb9f55b484240d1b1/9812969c49c1c550-45/s75x75_c1/9963180697beac92f8f8675ed7de539243e57a89.jpg 75w, https://64.media.tumblr.com/f77b0a7dc755df6fb9f55b484240d1b1/9812969c49c1c550-45/s100x200/88da0d39478477466539a8a7b8937065591d93b2.jpg 100w, https://64.media.tumblr.com/f77b0a7dc755df6fb9f55b484240d1b1/9812969c49c1c550-45/s250x400/6cf6d892fa04e3f9853ee606d6bc120323c5e5fd.jpg 250w, https://64.media.tumblr.com/f77b0a7dc755df6fb9f55b484240d1b1/9812969c49c1c550-45/s400x600/5ecaf40304034c6fe4e65b2e4998220e18282030.jpg 400w, https://64.media.tumblr.com/f77b0a7dc755df6fb9f55b484240d1b1/9812969c49c1c550-45/s500x750/5b763e6b8900a7eef7ce0820287b4fae8ffa494c.jpg 500w  sizes= (max-width: 500px) 100vw, 500px ></figure></div> is that a challenge???  ",
        "comments": [
            " \ud83d \udc41 \ud83d \udc44 \ud83d \udc41",
            "I mean you were technically right, this is a post I would like",
            "@liquid-geodes ",
            "@kaban-bang "
        ]
    },
    {
        "thread": " White boy off the damn perc <figure class= tmblr-full  data-orig-height= 1274  data-orig-width= 720  data-npf='{ type : video , provider : tumblr , url : https://va.media.tumblr.com/tumblr_rrn44eokqS1x4ubig.mp4 , media :{ url : https://va.media.tumblr.com/tumblr_rrn44eokqS1x4ubig.mp4 , type : video/mp4 , width :720, height :1274}, poster :[{ media_key : 080b8a70a517caa7ba8d75b3274722c6:d3bcdac07943f6aa-33 , type : image/jpeg , width :458, height :810, url : https://64.media.tumblr.com/080b8a70a517caa7ba8d75b3274722c6/d3bcdac07943f6aa-33/s540x810/fa8203782ff37f273fa6350b5f9ff9f4a563bead.jpg }]}'><video controls= controls  autoplay= autoplay  muted= muted  poster= https://64.media.tumblr.com/080b8a70a517caa7ba8d75b3274722c6/d3bcdac07943f6aa-33/s540x810/fa8203782ff37f273fa6350b5f9ff9f4a563bead.jpg ><source src= https://va.media.tumblr.com/tumblr_rrn44eokqS1x4ubig.mp4  type= video/mp4 ></source></video></figure> EDIT: <a href= https://www.tumblr.com/kapkant7/712065040507928577/realised-i-forgot-two-very-important-emotes-in >Part 2 now featuring two VERY IMPORTANT EMOTES  ",
        "comments": [
            "I CANT",
            "Leon backstage ?)",
            "Is this really how I had to find out that they put Leon in Fortnite.",
            "resident slay..."
        ]
    },
    {
        "thread": " <div class= npf_row ><figure class= tmblr-full  data-orig-height= 723  data-orig-width= 640 ><img src= https://64.media.tumblr.com/15cd306379814361bc8152197866f2b3/ce35fd391ea192b9-2c/s640x960/00e3c51445508677ee86ff6ca8c9f233ddce119f.jpg  data-orig-height= 723  data-orig-width= 640  srcset= https://64.media.tumblr.com/15cd306379814361bc8152197866f2b3/ce35fd391ea192b9-2c/s75x75_c1/2672a943938e9230f95e48f8bb314eec58d4a7b2.jpg 75w, https://64.media.tumblr.com/15cd306379814361bc8152197866f2b3/ce35fd391ea192b9-2c/s100x200/c495ba8f81ff7e65e93de86f617f4a9842d612e1.jpg 100w, https://64.media.tumblr.com/15cd306379814361bc8152197866f2b3/ce35fd391ea192b9-2c/s250x400/28e89df52a94a669d8a77e8d43e07d3c0b3592fe.jpg 250w, https://64.media.tumblr.com/15cd306379814361bc8152197866f2b3/ce35fd391ea192b9-2c/s400x600/6398b30e2c84826db770a9b767a9c59c5d30d5b4.jpg 400w, https://64.media.tumblr.com/15cd306379814361bc8152197866f2b3/ce35fd391ea192b9-2c/s500x750/65d6a798d17a89cb20cade6385f148ab366b1f65.jpg 500w, https://64.media.tumblr.com/15cd306379814361bc8152197866f2b3/ce35fd391ea192b9-2c/s540x810/7ff9edc4fd4570297ca115d3f536acf7633d3684.jpg 540w, https://64.media.tumblr.com/15cd306379814361bc8152197866f2b3/ce35fd391ea192b9-2c/s640x960/00e3c51445508677ee86ff6ca8c9f233ddce119f.jpg 640w  sizes= (max-width: 640px) 100vw, 640px ></figure></div> new tears of the kingdom trailer huh  ",
        "comments": [
            "What else was he supposed to do?",
            "you ’re just like me fr @pee-3po",
            "SOBBING THIS IS DNSJSHH",
            "@mossmustdie Nintendo saw Percy jump after Annabeth into Tartarus and said bet",
            "And he was stopped, he was ready to fall with her, fall FOR her. Leaving Hyrule, his sword, the world behind just to save her.",
            "And didn ’t he also toss aside the MASTER SWORD to jump after her?"
        ]
    },
    {
        "thread": " Nintendo Tears of the Kingdom Gameplay Demonstration: there are new enemies called  <b>constructs</b>     me, a tired Jew after hearing every fucking Zeldatuber call them golems for the past year: FUCK YES THANK YOU NINTENDO ",
        "comments": [
            "If you listen closely you can actually hear aonuma call them  golem  in japanese, unfortunately... construct is just the localized name, probably chosen to avoid overlap with the Jewish folklore",
            "And even then, I'm gonna call them lil guys",
            "As I'm only fluent in English I therefore will be playing the localized English version and only interact with the translations as I am given. The English video correctly called them something other than a name that isn't the type of automaton that they obviously are. Good on the translators for not calling it a golem then and realizing how offensive it would be, or perhaps not realizing, and just deciding not to. ",
            "Sorry but only in the eng vers are called that. Japanese and Spanish vers it ’s still Golem. \ud83d \ude05",
            "@jesseoftheorder  \ud83d \udc97 hope you enjoy!",
            "@ziskeyt Of course! I will totally check those out, thank you! Always happy to learn!",
            "@jesseoftheorder hey thanks for being willing to listen and learn! It's really appreciated! Myjewishlearning has a good briefer about them, and I believe Jewitches has a blog post about them that's a bit more informative.",
            "I'm really glad I saw this post, I had no idea golems were from Jewish folklore! I'm definitely gonna look more into the history of it, and of course be more conscious about how use it. Neat!",
            "@princessxombie  \ud83d \udc97 awww thank you!! i for love it a lot. hopefully it's something I can loophole like i did with the stupid clock shrine in botw. everyone hates the motion ones, but that shrine was horrible",
            "I ’m so sorry! That really sucks! I hope they make this one accessible to you. Your love for this series is so infectious it would be a shame if you couldn ’t experience it",
            "@princessxombie yes, i've never been able to play underwater levels, and since the stroke it's just worse. just watching someone play the flying in skyward sword made me feel horrible",
            "@excelsian i'm so impressed by these people who figure out and use all the glitches like windbombing and all that. i'm like ooooo i don't have the patience to figure this out lol",
            "do you have motion sickness or something that you're worried about the air combat? feel free not to answer if it's too personal",
            "@ziskeyt absolutely. Speedrunners and people who just have infinity patience are so fun to watch",
            "@excelsian I would absolutely watch that video, i love seeing people play who are better at games than i am!",
            "@ziskeyt As other Tumblrinas/Online people have said. GIve some japanese player 6h and they will construct a perfectly working Gundam which kills the endboss in one strike.",
            "@excelsian yeah i still wouldn't really like that myself, but it would be more of the spirit of what golems are, at least. but i mean, in this case nintendo isn't the one insisting that there's golems in the game so they don't even need to change anything in this regard.   though it WOULD be cool to fuse a construct to fight for you. or you can use to protect yourself like a gundam haha",
            "@excelsian Tough im not Jewish. So that whole  maybe if-  isnt really up to me to decide xD",
            "Maybe if TOTK showed a 'crafted' talus that you can use to protect urself. But the Constructs aren't really golem-esque",
            "They aren't even made of clay!",
            "entirely unsurprised and fed up with every person like this. they straight up call them constructs in the video but gosh that's just hard to wrap a head around i suppose",
            "....Speaking of the Devil xD"
        ]
    },
    {
        "thread": " <div class= npf_row ><figure class= tmblr-full  data-orig-height= 622  data-orig-width= 533 ><img src= https://64.media.tumblr.com/a5465a46e897e471b907c4c3a183f627/f42761c577630c2f-92/s640x960/3eecfb8c17a9d10240366f75e1c15481c8fc14c2.jpg  data-orig-height= 622  data-orig-width= 533  srcset= https://64.media.tumblr.com/a5465a46e897e471b907c4c3a183f627/f42761c577630c2f-92/s75x75_c1/00fa3c3e331779858f66b8dff1daeaac52872763.jpg 75w, https://64.media.tumblr.com/a5465a46e897e471b907c4c3a183f627/f42761c577630c2f-92/s100x200/07c790a8e9ed5c637a6d149bb4c804b8a7907dde.jpg 100w, https://64.media.tumblr.com/a5465a46e897e471b907c4c3a183f627/f42761c577630c2f-92/s250x400/072b70b2be7ac3a71b79b40e70ea82833b70b1ea.jpg 250w, https://64.media.tumblr.com/a5465a46e897e471b907c4c3a183f627/f42761c577630c2f-92/s400x600/0150652a50e2c0672b946322c93ba1552d92781f.jpg 400w, https://64.media.tumblr.com/a5465a46e897e471b907c4c3a183f627/f42761c577630c2f-92/s500x750/4cbe75b8f95c1988801932042094f48d76cb74c7.jpg 500w, https://64.media.tumblr.com/a5465a46e897e471b907c4c3a183f627/f42761c577630c2f-92/s540x810/947301ad8256baf0ee4b45491cb7c4604da7f4f1.jpg 533w  sizes= (max-width: 533px) 100vw, 533px ></figure></div> hes literally just standing  ",
        "comments": [
            " \ud83e \uddcd",
            "The man of my dreams",
            "And he is being very brave about it !",
            "he said  \ud83e \uddcd"
        ]
    },
    {
        "thread": " <div class= npf_row ><figure class= tmblr-full  data-orig-height= 640  data-orig-width= 640 ><img src= https://64.media.tumblr.com/fb6643dc4b3ed491cf03b8a30488cb7c/2b7fb6ab452eeaae-e9/s640x960/4aea6e0d6a40d117092f2a75f88577890484f105.jpg  data-orig-height= 640  data-orig-width= 640  srcset= https://64.media.tumblr.com/fb6643dc4b3ed491cf03b8a30488cb7c/2b7fb6ab452eeaae-e9/s75x75_c1/efdcb332a2feea5aff2ed0851fd6c9b3c2e811ca.jpg 75w, https://64.media.tumblr.com/fb6643dc4b3ed491cf03b8a30488cb7c/2b7fb6ab452eeaae-e9/s100x200/a31c80b8fbe6d72c4f95f5b6ab04d959800f4b18.jpg 100w, https://64.media.tumblr.com/fb6643dc4b3ed491cf03b8a30488cb7c/2b7fb6ab452eeaae-e9/s250x400/1358197b64bc1c7cfa33d51ec4acc185eb4cbd33.jpg 250w, https://64.media.tumblr.com/fb6643dc4b3ed491cf03b8a30488cb7c/2b7fb6ab452eeaae-e9/s400x600/0f473c2b5e315691fba5f5517a3daac9f86f1c54.jpg 400w, https://64.media.tumblr.com/fb6643dc4b3ed491cf03b8a30488cb7c/2b7fb6ab452eeaae-e9/s500x750/4f5d7eafce04184922789a37448edb9517ed55dc.jpg 500w, https://64.media.tumblr.com/fb6643dc4b3ed491cf03b8a30488cb7c/2b7fb6ab452eeaae-e9/s540x810/33b443c782e83f9ddfde771c2b4dbab46a7f936f.jpg 540w, https://64.media.tumblr.com/fb6643dc4b3ed491cf03b8a30488cb7c/2b7fb6ab452eeaae-e9/s640x960/4aea6e0d6a40d117092f2a75f88577890484f105.jpg 640w  sizes= (max-width: 640px) 100vw, 640px ></figure></div><div class= npf_row ><figure class= tmblr-full  data-orig-height= 640  data-orig-width= 640 ><img src= https://64.media.tumblr.com/6d188302cab743c743a6af1d9a37439e/2b7fb6ab452eeaae-92/s640x960/7514911adc2a4cc3c99a9f297c15a44c9f543df2.jpg  data-orig-height= 640  data-orig-width= 640  srcset= https://64.media.tumblr.com/6d188302cab743c743a6af1d9a37439e/2b7fb6ab452eeaae-92/s75x75_c1/fc75aeb15d78412d634efa77025b9280a7575127.jpg 75w, https://64.media.tumblr.com/6d188302cab743c743a6af1d9a37439e/2b7fb6ab452eeaae-92/s100x200/1916de4b34009aa91f76af8193bce990598997db.jpg 100w, https://64.media.tumblr.com/6d188302cab743c743a6af1d9a37439e/2b7fb6ab452eeaae-92/s250x400/b517973c7f667d8fc87ef0150496cabea6482bfa.jpg 250w, https://64.media.tumblr.com/6d188302cab743c743a6af1d9a37439e/2b7fb6ab452eeaae-92/s400x600/e0b809c21d5d6a2263f7a13fc133eac7b3635521.jpg 400w, https://64.media.tumblr.com/6d188302cab743c743a6af1d9a37439e/2b7fb6ab452eeaae-92/s500x750/bad879b78984a0aeef3b668011b5f68c10fe7dec.jpg 500w, https://64.media.tumblr.com/6d188302cab743c743a6af1d9a37439e/2b7fb6ab452eeaae-92/s540x810/57e4d6190a21b18bbae46b6dd179fedd0e180915.jpg 540w, https://64.media.tumblr.com/6d188302cab743c743a6af1d9a37439e/2b7fb6ab452eeaae-92/s640x960/7514911adc2a4cc3c99a9f297c15a44c9f543df2.jpg 640w  sizes= (max-width: 640px) 100vw, 640px ></figure><figure class= tmblr-full  data-orig-height= 640  data-orig-width= 640 ><img src= https://64.media.tumblr.com/3b72e01e9737ee98187122dfd704a8ac/2b7fb6ab452eeaae-4d/s640x960/a0f09e2e12174ca18048d66ccbc1663145922bb4.jpg  data-orig-height= 640  data-orig-width= 640  srcset= https://64.media.tumblr.com/3b72e01e9737ee98187122dfd704a8ac/2b7fb6ab452eeaae-4d/s75x75_c1/fb68b7b1e50d02851b48f8e57a2882c6effa28b9.jpg 75w, https://64.media.tumblr.com/3b72e01e9737ee98187122dfd704a8ac/2b7fb6ab452eeaae-4d/s100x200/3143bf62013ba7e1ab55d4a788b27ac97b53c121.jpg 100w, https://64.media.tumblr.com/3b72e01e9737ee98187122dfd704a8ac/2b7fb6ab452eeaae-4d/s250x400/0a25300d97b16a7cccc90f52df72b3bd97129f06.jpg 250w, https://64.media.tumblr.com/3b72e01e9737ee98187122dfd704a8ac/2b7fb6ab452eeaae-4d/s400x600/8572788ab059d24afc5aa616828f8d974a2a51dc.jpg 400w, https://64.media.tumblr.com/3b72e01e9737ee98187122dfd704a8ac/2b7fb6ab452eeaae-4d/s500x750/c6a1f98f79d1080533f41de885c831d49dbd59ac.jpg 500w, https://64.media.tumblr.com/3b72e01e9737ee98187122dfd704a8ac/2b7fb6ab452eeaae-4d/s540x810/a1ea9ae2d0c4ee8aa7a7857ba023db036ab14ae3.jpg 540w, https://64.media.tumblr.com/3b72e01e9737ee98187122dfd704a8ac/2b7fb6ab452eeaae-4d/s640x960/a0f09e2e12174ca18048d66ccbc1663145922bb4.jpg 640w  sizes= (max-width: 640px) 100vw, 640px ></figure></div><div class= npf_row ><figure class= tmblr-full  data-orig-height= 640  data-orig-width= 640 ><img src= https://64.media.tumblr.com/593566b31ef9577dd8be52dd49c126ca/2b7fb6ab452eeaae-8c/s640x960/dfa68dc3aaf41d22e000f4e93436ca90907002c3.jpg  data-orig-height= 640  data-orig-width= 640  srcset= https://64.media.tumblr.com/593566b31ef9577dd8be52dd49c126ca/2b7fb6ab452eeaae-8c/s75x75_c1/379b2411032674029c2a2b5b8d677a5fc4137ce9.jpg 75w, https://64.media.tumblr.com/593566b31ef9577dd8be52dd49c126ca/2b7fb6ab452eeaae-8c/s100x200/068afc9ace5fc51a26293db88647e922c4537729.jpg 100w, https://64.media.tumblr.com/593566b31ef9577dd8be52dd49c126ca/2b7fb6ab452eeaae-8c/s250x400/ace1fb685ec3396ff22f182cb5e1b43c477c6b7c.jpg 250w, https://64.media.tumblr.com/593566b31ef9577dd8be52dd49c126ca/2b7fb6ab452eeaae-8c/s400x600/8ad57fce9f8ca1d46838fadb118a233af7b12b8e.jpg 400w, https://64.media.tumblr.com/593566b31ef9577dd8be52dd49c126ca/2b7fb6ab452eeaae-8c/s500x750/286a9fcdb39af18d8229db0c3fc100f8930de201.jpg 500w, https://64.media.tumblr.com/593566b31ef9577dd8be52dd49c126ca/2b7fb6ab452eeaae-8c/s540x810/925c75b512bfb3af8e43b198f9fad4657cda01d0.jpg 540w, https://64.media.tumblr.com/593566b31ef9577dd8be52dd49c126ca/2b7fb6ab452eeaae-8c/s640x960/dfa68dc3aaf41d22e000f4e93436ca90907002c3.jpg 640w  sizes= (max-width: 640px) 100vw, 640px ></figure><figure class= tmblr-full  data-orig-height= 640  data-orig-width= 640 ><img src= https://64.media.tumblr.com/dcd79342c2dcc223bfe86447d1e7d0ad/2b7fb6ab452eeaae-7b/s640x960/22924b5b46b388d8f2b42994c833c1ae5602f206.jpg  data-orig-height= 640  data-orig-width= 640  srcset= https://64.media.tumblr.com/dcd79342c2dcc223bfe86447d1e7d0ad/2b7fb6ab452eeaae-7b/s75x75_c1/b032418f607c72d4cf11caa6650d31573611a67c.jpg 75w, https://64.media.tumblr.com/dcd79342c2dcc223bfe86447d1e7d0ad/2b7fb6ab452eeaae-7b/s100x200/0c034996b72f7478637f048a13718f4cc8d7ecd2.jpg 100w, https://64.media.tumblr.com/dcd79342c2dcc223bfe86447d1e7d0ad/2b7fb6ab452eeaae-7b/s250x400/3bb83ee73191477a616a308971e58ddb5b2f6746.jpg 250w, https://64.media.tumblr.com/dcd79342c2dcc223bfe86447d1e7d0ad/2b7fb6ab452eeaae-7b/s400x600/a59348bf14682f2fc4a783ce5c0e068129970535.jpg 400w, https://64.media.tumblr.com/dcd79342c2dcc223bfe86447d1e7d0ad/2b7fb6ab452eeaae-7b/s500x750/f6926b2f5aa9c8dc177628f6f6c212b4cfa2f93b.jpg 500w, https://64.media.tumblr.com/dcd79342c2dcc223bfe86447d1e7d0ad/2b7fb6ab452eeaae-7b/s540x810/65a2f63a29d6a0caa6b89c8f3753ff0c43cdbd4e.jpg 540w, https://64.media.tumblr.com/dcd79342c2dcc223bfe86447d1e7d0ad/2b7fb6ab452eeaae-7b/s640x960/22924b5b46b388d8f2b42994c833c1ae5602f206.jpg 640w  sizes= (max-width: 640px) 100vw, 640px ></figure></div><div class= npf_row ><figure class= tmblr-full  data-orig-height= 640  data-orig-width= 640 ><img src= https://64.media.tumblr.com/6e98cfa0a203076287287d6dea548bc4/2b7fb6ab452eeaae-39/s640x960/8f70ae000e02a1f295323faa62cabf1d4ffd129a.jpg  data-orig-height= 640  data-orig-width= 640  srcset= https://64.media.tumblr.com/6e98cfa0a203076287287d6dea548bc4/2b7fb6ab452eeaae-39/s75x75_c1/736540eeff75a464715a6589a109fdaa96932073.jpg 75w, https://64.media.tumblr.com/6e98cfa0a203076287287d6dea548bc4/2b7fb6ab452eeaae-39/s100x200/a318cd58f85fe480e8cd4439d1ffa2b5ae8b93d3.jpg 100w, https://64.media.tumblr.com/6e98cfa0a203076287287d6dea548bc4/2b7fb6ab452eeaae-39/s250x400/2d3d276e7bf68fa85e5ce88740d42c704581b145.jpg 250w, https://64.media.tumblr.com/6e98cfa0a203076287287d6dea548bc4/2b7fb6ab452eeaae-39/s400x600/c8989190b8771d60672338ccbb84e3ba7af88e73.jpg 400w, https://64.media.tumblr.com/6e98cfa0a203076287287d6dea548bc4/2b7fb6ab452eeaae-39/s500x750/ba8827b15509a1b609f3d55fa7b519b9f6fca4a5.jpg 500w, https://64.media.tumblr.com/6e98cfa0a203076287287d6dea548bc4/2b7fb6ab452eeaae-39/s540x810/cf5f7042d9be98ca72e8b66015dddd3bdee037fa.jpg 540w, https://64.media.tumblr.com/6e98cfa0a203076287287d6dea548bc4/2b7fb6ab452eeaae-39/s640x960/8f70ae000e02a1f295323faa62cabf1d4ffd129a.jpg 640w  sizes= (max-width: 640px) 100vw, 640px ></figure><figure class= tmblr-full  data-orig-height= 640  data-orig-width= 640 ><img src= https://64.media.tumblr.com/0e707948aaf5362ce194778775638186/2b7fb6ab452eeaae-6d/s640x960/bad446d0ee843b353e60a66c6c916c64eecbb29d.jpg  data-orig-height= 640  data-orig-width= 640  srcset= https://64.media.tumblr.com/0e707948aaf5362ce194778775638186/2b7fb6ab452eeaae-6d/s75x75_c1/9a0e0c4418bee50325c0819b117fcec34bcd764a.jpg 75w, https://64.media.tumblr.com/0e707948aaf5362ce194778775638186/2b7fb6ab452eeaae-6d/s100x200/7e844798780db909ccbd1cb103e2d15c76fdc4f0.jpg 100w, https://64.media.tumblr.com/0e707948aaf5362ce194778775638186/2b7fb6ab452eeaae-6d/s250x400/6a8f38777e01c9c1bb9276458850c97a9b26ac89.jpg 250w, https://64.media.tumblr.com/0e707948aaf5362ce194778775638186/2b7fb6ab452eeaae-6d/s400x600/3b7410bb9fb9fd74bbb755449ac308457dc995e9.jpg 400w, https://64.media.tumblr.com/0e707948aaf5362ce194778775638186/2b7fb6ab452eeaae-6d/s500x750/ba83adfee84d0479114d4e91c962b9f0b69d3509.jpg 500w, https://64.media.tumblr.com/0e707948aaf5362ce194778775638186/2b7fb6ab452eeaae-6d/s540x810/4ea4fd7d5cce402855c4ac14c94ca7cb83bcae74.jpg 540w, https://64.media.tumblr.com/0e707948aaf5362ce194778775638186/2b7fb6ab452eeaae-6d/s640x960/bad446d0ee843b353e60a66c6c916c64eecbb29d.jpg 640w  sizes= (max-width: 640px) 100vw, 640px ></figure></div> Nintendo officially announced a Tears of the Kingdom edition OLED switch, pro controller and carrying case. They are really trying to make me go bankrupt this year  \ud83d \udcb8 \ud83d \udcb8 \ud83d \udcb8  ",
        "comments": [
            "I ’m seriously thinking about trading in my original Switch for the Zelda OLED Switch with my tax return. I did just buy myself a PlayStation 5 for my birthday so maybe I should cool it on the steep video game purchases  \ud83e \udd23",
            "@hardcases-homo-homie around $359.99 according to Nintendo.com, the pro controller will be around 75$ and case will be around 25$",
            "does anybody know the price yet?",
            "That pro controller looks fucking nice"
        ]
    },
    {
        "thread": " OKAY HERE ME OUT <div class= npf_row ><figure class= tmblr-full  data-orig-height= 289  data-orig-width= 232 ><img src= https://64.media.tumblr.com/3ac40074022db75b0ba08ffb6225b215/3176cfc2b5b6a34b-07/s640x960/e658c92ee59358505a73258d9ea101af2370e9c6.jpg  data-orig-height= 289  data-orig-width= 232  srcset= https://64.media.tumblr.com/3ac40074022db75b0ba08ffb6225b215/3176cfc2b5b6a34b-07/s75x75_c1/fd21987a6ec7793fda9b00896b253a63f0d9ca24.jpg 75w, https://64.media.tumblr.com/3ac40074022db75b0ba08ffb6225b215/3176cfc2b5b6a34b-07/s100x200/9391d188c70d1b48dffca7222e593498bf49d9f1.jpg 100w, https://64.media.tumblr.com/3ac40074022db75b0ba08ffb6225b215/3176cfc2b5b6a34b-07/s250x400/572e23d6d40fbd7f1bebf95ebc8ab0cdb7551515.jpg 232w  sizes= (max-width: 232px) 100vw, 232px ></figure><figure class= tmblr-full  data-orig-height= 647  data-orig-width= 805 ><img src= https://64.media.tumblr.com/ce517a298f3d183b10c29fe799846594/3176cfc2b5b6a34b-4a/s640x960/553d2ad65fb6af29e80b9caed22a2befa6ff246e.jpg  data-orig-height= 647  data-orig-width= 805  srcset= https://64.media.tumblr.com/ce517a298f3d183b10c29fe799846594/3176cfc2b5b6a34b-4a/s75x75_c1/d0c418d4caca38533a94e4a63f00055031a2f8a5.jpg 75w, https://64.media.tumblr.com/ce517a298f3d183b10c29fe799846594/3176cfc2b5b6a34b-4a/s100x200/598a9709d90ce2aeaeb9bac49f9d60c172f5e768.jpg 100w, https://64.media.tumblr.com/ce517a298f3d183b10c29fe799846594/3176cfc2b5b6a34b-4a/s250x400/e3e1264cd04f7522bc85989ab8d88c4e36d6a178.jpg 250w, https://64.media.tumblr.com/ce517a298f3d183b10c29fe799846594/3176cfc2b5b6a34b-4a/s400x600/82a37eede3c6099f2e858a8a4fd10564dd48c0b4.jpg 400w, https://64.media.tumblr.com/ce517a298f3d183b10c29fe799846594/3176cfc2b5b6a34b-4a/s500x750/1f81f37095f6c400607cf39ad25ecc3f21aa130b.jpg 500w, https://64.media.tumblr.com/ce517a298f3d183b10c29fe799846594/3176cfc2b5b6a34b-4a/s540x810/80e8cecbceb47b2ead1e82e61a6498290027932e.jpg 540w, https://64.media.tumblr.com/ce517a298f3d183b10c29fe799846594/3176cfc2b5b6a34b-4a/s640x960/553d2ad65fb6af29e80b9caed22a2befa6ff246e.jpg 640w, https://64.media.tumblr.com/ce517a298f3d183b10c29fe799846594/3176cfc2b5b6a34b-4a/s1280x1920/4bf9e45b20a67aa9fe24b5f8a19cb265cd0be46a.jpg 805w  sizes= (max-width: 805px) 100vw, 805px ></figure></div>     They ’re the same ",
        "comments": [
            "time has NOT done them any favours",
            "YES YES YES A THOUSAND TIMES YES",
            "TRUEEE",
            "OH BOY OH BOY OH BOY OH BOY! We ’re in for a TREAT with the lore this time, aren ’t we?",
            "I THOUGHT THE SAME",
            "Hehe",
            "They're angry at link for hurting Mistress Fi",
            "I was thinking the SAME thing!"
        ]
    },
    {
        "thread": "  I would die for this little korok wearing a backpack <figure data-orig-height= 174  data-orig-width= 181 ><img src= https://64.media.tumblr.com/625dae099552e6bbbcbf3045837f160c/e23d05b31af3e621-64/s640x960/a76666eddb54d0cc70940bc041ee62c40b54b86a.png  data-orig-height= 174  data-orig-width= 181  srcset= https://64.media.tumblr.com/625dae099552e6bbbcbf3045837f160c/e23d05b31af3e621-64/s75x75_c1/a2ca942ce48f3a30b1854c06e3dd6a5a5099019c.png 75w, https://64.media.tumblr.com/625dae099552e6bbbcbf3045837f160c/e23d05b31af3e621-64/s100x200/bd5b52a0c52ceae782930d6743917ebf857b304a.png 100w, https://64.media.tumblr.com/625dae099552e6bbbcbf3045837f160c/e23d05b31af3e621-64/s250x400/ca25e426f921dace6fdb393a41d071d38618346e.png 181w  sizes= (max-width: 181px) 100vw, 181px ></figure> ",
        "comments": [
            "I love this Korok and I don't even know their name",
            "Oml how did I not see him-",
            "I ’m already thinking on making it a plushie  \ud83e \udd79",
            "Death Stranding (2019)"
        ]
    },
    {
        "thread": " First thought on the tears of the kingdom gameplay is how the speedrunners are gonna have a field day with all of this ",
        "comments": [
            "cant wait for the flying machines",
            "nintendo: hey guys we made a cool new open world game with these awesome features",
            "Also re: this",
            "#the abominations they are going to create with fuse (via staffs-secret-blog)"
        ]
    },
    {
        "thread": " Storytime with Master Neloth :3  (version with art is <a href= https://at.tumblr.com/the-sunlit-earth/709181669081579521/84zcbbnpyzff >here ) ",
        "comments": [
            "I feel like he found a fan fic",
            "I love this more than words ",
            "i'm crying how is this so seamless",
            "the plot twist ( ⁠ ´ ⁠ ⊙ ⁠ ω ⁠ ⊙ ⁠` ⁠) ⁠ ！",
            "i know nothing of dunmer/morrowind lore and i am taking this as gospel"
        ]
    },
    {
        "thread": " <div class= npf_row ><figure class= tmblr-full  data-orig-height= 3021  data-orig-width= 1845 ><img src= https://64.media.tumblr.com/6da59afd40e20b9e5dbe19c5e638996e/879e35cda9c2538b-59/s640x960/0ebf1b431b0924339742d8c4339b7230fe6c1d08.png  data-orig-height= 3021  data-orig-width= 1845  srcset= https://64.media.tumblr.com/6da59afd40e20b9e5dbe19c5e638996e/879e35cda9c2538b-59/s75x75_c1/d4ec41197141840bd007844392c5c72cf53a18c2.png 75w, https://64.media.tumblr.com/6da59afd40e20b9e5dbe19c5e638996e/879e35cda9c2538b-59/s100x200/1f9ab121738a9bc319b6499979b2e1e7846b4be5.png 100w, https://64.media.tumblr.com/6da59afd40e20b9e5dbe19c5e638996e/879e35cda9c2538b-59/s250x400/6d5ca678341070c09a23f40444a7a2cdaa11a323.png 244w, https://64.media.tumblr.com/6da59afd40e20b9e5dbe19c5e638996e/879e35cda9c2538b-59/s400x600/bb9bf930eaca17b4adb4e766d974cfcd740a725c.png 366w, https://64.media.tumblr.com/6da59afd40e20b9e5dbe19c5e638996e/879e35cda9c2538b-59/s500x750/d81cd535ac5bdc6b09f4bb03049d991859341e54.png 458w, https://64.media.tumblr.com/6da59afd40e20b9e5dbe19c5e638996e/879e35cda9c2538b-59/s540x810/1412c051c024d2563a48f9fd25ff2b6860d0e319.png 495w, https://64.media.tumblr.com/6da59afd40e20b9e5dbe19c5e638996e/879e35cda9c2538b-59/s640x960/0ebf1b431b0924339742d8c4339b7230fe6c1d08.png 586w, https://64.media.tumblr.com/6da59afd40e20b9e5dbe19c5e638996e/879e35cda9c2538b-59/s1280x1920/b0d5b68c3a9168d5087f0134578409b4b004b029.png 1173w, https://64.media.tumblr.com/6da59afd40e20b9e5dbe19c5e638996e/879e35cda9c2538b-59/s2048x3072/d8498743efd22318dfc81e03b92bb208c41036be.png 1845w  sizes= (max-width: 1280px) 100vw, 1280px ></figure></div> ",
        "comments": [
            "@imnotjellyatall-art thank you!",
            "adorable!",
            "@sneaksandsweets  д у ж е  р а д а,  щ о  с п о д о б а л о с ь!",
            "@madredp  Д я к у ю!",
            "Woah, this is gorgeous",
            "Amazing work!!  ❤ ️ ‍ \ud83d \udd25 ❤ ️ ‍ \ud83d \udd25 ❤ ️ ‍ \ud83d \udd25"
        ]
    },
    {
        "thread": " <div class= npf_row ><figure class= tmblr-full  data-orig-height= 546  data-orig-width= 982 ><img src= https://64.media.tumblr.com/3bcaa4e35801b242012ddae62a8b7dad/a08bf7bbedc01bac-cf/s640x960/c473cffa842615c2f960d91c658c1ad430a573d5.jpg  data-orig-height= 546  data-orig-width= 982  srcset= https://64.media.tumblr.com/3bcaa4e35801b242012ddae62a8b7dad/a08bf7bbedc01bac-cf/s75x75_c1/e983f8edd6b755b26d0ae51c9fe657219ae81edb.jpg 75w, https://64.media.tumblr.com/3bcaa4e35801b242012ddae62a8b7dad/a08bf7bbedc01bac-cf/s100x200/9ba687ea7e97cb0e4a134e8b1e26ffd88607eb90.jpg 100w, https://64.media.tumblr.com/3bcaa4e35801b242012ddae62a8b7dad/a08bf7bbedc01bac-cf/s250x400/c7d49fce285fa5db61044b2519ec19b88ff961b5.jpg 250w, https://64.media.tumblr.com/3bcaa4e35801b242012ddae62a8b7dad/a08bf7bbedc01bac-cf/s400x600/9aecf0311114aa1ffa1cc69d4e3927ece2cd0478.jpg 400w, https://64.media.tumblr.com/3bcaa4e35801b242012ddae62a8b7dad/a08bf7bbedc01bac-cf/s500x750/98961507dbfbab13c7b53cf6f80e8d98b775b050.jpg 500w, https://64.media.tumblr.com/3bcaa4e35801b242012ddae62a8b7dad/a08bf7bbedc01bac-cf/s540x810/dca9068952c69db76d2981b70cce43bd7d766376.jpg 540w, https://64.media.tumblr.com/3bcaa4e35801b242012ddae62a8b7dad/a08bf7bbedc01bac-cf/s640x960/c473cffa842615c2f960d91c658c1ad430a573d5.jpg 640w, https://64.media.tumblr.com/3bcaa4e35801b242012ddae62a8b7dad/a08bf7bbedc01bac-cf/s1280x1920/f13bb50365f78b77705ac563e2542697fc7f5320.jpg 982w  sizes= (max-width: 982px) 100vw, 982px ></figure></div> Alright which table you sitting at?  ",
        "comments": [
            "Dark brotherhood for sure",
            "dark brotherhood table",
            "Where is the table with Neloth I want to sit with the crazy mushroom wizard",
            "nazeem by himself lmaoo",
            "Mage collage, only cause all the other options suck way more.",
            "I'm no fan of the thalmor but you *know* they have the best gossip",
            "@macabre-changeling ",
            "Gotta say I'm gonna go sit with the Brotherhood on this one",
            "wheres the parthanax, alduin, d preist table???? Deadra cult table???",
            "Im sitting on the floor playing yuigio with miraak",
            "I would sit at either the dark brotherhood table or the college of winter hold. Interesting stories with both those guys. (Would have put down thieves guild but they'd probably smell like shit) (literally)",
            "None of them.",
            "I would drag a chair between to companions table and the dark brotherhood table.",
            "Me @ the Dark Brotherhood table",
            "The Brotherhood ",
            "just because cicero is there im going to sit with farkas vilkas and aela. or with j ’zargo. I would have sat there immediately if it weren ’t for him",
            "@mangorumpuscandyfactory welcome to skyrim everyone is ralof : )",
            "im sitting with nazeem so we can kiss mightily.",
            "I love how Nazeem isn ’t even sitting at the table with Jarl Bulgruuf aka the cloud district table lmaoo  \ud83d \ude02",
            "Vex and brynjolf ofc bisexual dream"
        ]
    },
    {
        "thread": " <div class= npf_row ><figure class= tmblr-full  data-orig-height= 2048  data-orig-width= 1605 ><img src= https://64.media.tumblr.com/9c3a449d2b1862703e297e0a0e7b4814/84f80e530937e2c9-52/s640x960/6848018b2c2932f04125c2802a6135fc61cc02c3.png  data-orig-height= 2048  data-orig-width= 1605  srcset= https://64.media.tumblr.com/9c3a449d2b1862703e297e0a0e7b4814/84f80e530937e2c9-52/s75x75_c1/f4b149549141a39f55a5f10fdc1e9737127bfb8f.png 75w, https://64.media.tumblr.com/9c3a449d2b1862703e297e0a0e7b4814/84f80e530937e2c9-52/s100x200/cd1aaa92b86905f03e434b280ab352013184b009.png 100w, https://64.media.tumblr.com/9c3a449d2b1862703e297e0a0e7b4814/84f80e530937e2c9-52/s250x400/8d873454b951b3c74b89d125db3a860357555f12.png 250w, https://64.media.tumblr.com/9c3a449d2b1862703e297e0a0e7b4814/84f80e530937e2c9-52/s400x600/dece49f18a49731a7f1214ddd1eb5af7b1b077c3.png 400w, https://64.media.tumblr.com/9c3a449d2b1862703e297e0a0e7b4814/84f80e530937e2c9-52/s500x750/169d9cb6d7fdf9c916ebb09d3a558ebc9a4e3388.png 500w, https://64.media.tumblr.com/9c3a449d2b1862703e297e0a0e7b4814/84f80e530937e2c9-52/s540x810/5715c321039d649ea1664bea419f32f7f67bb895.png 540w, https://64.media.tumblr.com/9c3a449d2b1862703e297e0a0e7b4814/84f80e530937e2c9-52/s640x960/6848018b2c2932f04125c2802a6135fc61cc02c3.png 640w, https://64.media.tumblr.com/9c3a449d2b1862703e297e0a0e7b4814/84f80e530937e2c9-52/s1280x1920/33f5b188abad094caaab945abe197bdc1977230d.png 1280w, https://64.media.tumblr.com/9c3a449d2b1862703e297e0a0e7b4814/84f80e530937e2c9-52/s2048x3072/fa33c8c35d27fcd0bc33f931bc8ca287f8b09141.png 1605w  sizes= (max-width: 1280px) 100vw, 1280px ></figure></div> Sarel teaching Gelebor about the Sightless Alphabet!   ",
        "comments": [
            "u gotta stop giving me emotions dude. this is too good ",
            "This is so precious!!  \ud83e \udd7a \ud83d \udc96 \ud83d \udc95",
            "@demonwrestler Oh man, that in-game hair is such a Mess. I've been trying to figure out ways to translate it into something manageable. This is one of those ways.",
            "THANK YOU for this BEAUTIFUL GIFT and thank you for giving Gelebor a decent haircut  \ud83d \ude4f \ud83d \ude4f \ud83d \ude4f \ud83d \ude4f",
            "I love how you emphasize the Falmer haven ’t actually changed all that much.",
            "Omg he's baby  \ud83e \udd7a"
        ]
    },
    {
        "thread": " i think it would be cool if instead of being famous and well-liked the Dragonborn was seen as like a bad sign. Wherever they show up dragons reappear or wars break out -  even if it ’s not their fault and they ’re trying to solve these issues  - I just think it would be cool if they were seen as a bad omen.  ",
        "comments": [
            "your dog looks traumatized. ",
            "...male a Khajiit DB, name them Absol",
            "Like Gandalf in Rohan. He ’s all  “hey, there ’s trouble, I ’m here to help ” and everyone ’s like  “oh look there ’s trouble and Gandalf arrives. Interesting. ”",
            "You might like the Wheel of Time books then, where the hero is reincarnated after 3000 years as a regular farm boy who learns magic. The fact that he learns magic makes everyone afraid of him, and pigeon holes him into becoming a world conquering war lord. It's pretty good, but the author did have some sexist themes I don't love. ",
            "I've thought about this a lot!  I've been trying to figure out a good Nord epithet translating as 'ill wind', but I'm worried that just makes it sound like you're describing a fart.",
            "But then how would you be an all-powerful god worshipped by all?",
            "Play dragon quest 11, it's a plot point for a while"
        ]
    },
    {
        "thread": " Nords are the Florida men of Tamriel  ",
        "comments": [
            "Florida Man found naked after fighting the undead while intoxicated",
            "We discussed this in a TES discord server once",
            "@turianjournalist",
            "This is Argonia erasure.",
            "A true son of Skyrim",
            "(I've never drawn a bear before)"
        ]
    },
    {
        "thread": " .  Modding Skyrim and playing Skyrim are two separate hobbies and I ’ll stand by that. ",
        "comments": [
            "My partner has not actually PLAYED Skyrim in years. It's all updating mods and loading sequences and finding new ways to make the sky (which he will never see) look pretty.",
            "People?? Mod it so much theres like 80 hours of work involved??? I mod it and the worst I ever had was like 2 hours to debug my mod order, *once*.",
            "@denjiro the merge mods application can help you around that limit! If you include texture and mesh mods I'm running several thousand on my (oldrim) Skyrim :D",
            "@jesterplays it's called Becoming a Bard and it turns Bard into an actual class with quests.",
            "There was a post where someone called modding Skyrim  foreplay with Todd  and that's what I think of EVERY TIME NOW and can't stop laughing the entire time. ",
            "bard mod??",
            "Off topic but hOW MANY CHECK MARKS DO YOU HAVE NOW??!?",
            "@between-two-worlds ​",
            "Which one are you currently doing? OH! What race do you enjoy playing the most? Atm mine is Khajiit. Used to be Altmer. ",
            "If you're remodding, I highly recommend Animated Traversal - it came outast year and lets you do PARKOUR in dungeons, climb over walls and up ladders, and it makes me so happy to use."
        ]
    },
    {
        "thread": " <div class= npf_row ><figure class= tmblr-full  data-orig-height= 1024  data-orig-width= 953 ><img src= https://64.media.tumblr.com/e0496bbd5321170609756b2c3badc365/e8ace5742530bdc8-9d/s640x960/f875690b0e2d4a5cc2de1d39f8781cbbaa045040.jpg  data-orig-height= 1024  data-orig-width= 953  srcset= https://64.media.tumblr.com/e0496bbd5321170609756b2c3badc365/e8ace5742530bdc8-9d/s75x75_c1/e2601d17bcd4f8cdb143a81f39f7241346bfe570.jpg 75w, https://64.media.tumblr.com/e0496bbd5321170609756b2c3badc365/e8ace5742530bdc8-9d/s100x200/05f830e7d94dacb4f9d3b46d6e40d26e567444c5.jpg 100w, https://64.media.tumblr.com/e0496bbd5321170609756b2c3badc365/e8ace5742530bdc8-9d/s250x400/1aa79faf3a9826d749441323250f46fe2ca18196.jpg 250w, https://64.media.tumblr.com/e0496bbd5321170609756b2c3badc365/e8ace5742530bdc8-9d/s400x600/51e5e88d1ce2b1d9e87e09d5a45d1096f2734e2a.jpg 400w, https://64.media.tumblr.com/e0496bbd5321170609756b2c3badc365/e8ace5742530bdc8-9d/s500x750/edf2ee64f8e0eab21bedcf3b319f4186dc3c6421.jpg 500w, https://64.media.tumblr.com/e0496bbd5321170609756b2c3badc365/e8ace5742530bdc8-9d/s540x810/1b90ca0619efdd3f8eaeedb919f40651f1b647cc.jpg 540w, https://64.media.tumblr.com/e0496bbd5321170609756b2c3badc365/e8ace5742530bdc8-9d/s640x960/f875690b0e2d4a5cc2de1d39f8781cbbaa045040.jpg 640w, https://64.media.tumblr.com/e0496bbd5321170609756b2c3badc365/e8ace5742530bdc8-9d/s1280x1920/cdef3b99a9cdfc802f8ffc2a21ee62b3bc53eb8f.jpg 953w  sizes= (max-width: 953px) 100vw, 953px ></figure></div> Elves and men <div class= npf_row ><figure class= tmblr-full  data-orig-height= 622  data-orig-width= 969 ><img src= https://64.media.tumblr.com/4c20bbd45ec1d9dbd48a78035abb52e3/e8ace5742530bdc8-0b/s640x960/dc7f617d89762b3a1f30754efd365f0f8fb1997a.jpg  data-orig-height= 622  data-orig-width= 969  srcset= https://64.media.tumblr.com/4c20bbd45ec1d9dbd48a78035abb52e3/e8ace5742530bdc8-0b/s75x75_c1/d35d99cacb9d4c8078336216c9ddb6393f71eccc.jpg 75w, https://64.media.tumblr.com/4c20bbd45ec1d9dbd48a78035abb52e3/e8ace5742530bdc8-0b/s100x200/b32ed44b79732342b246c60967170f198b8a2f32.jpg 100w, https://64.media.tumblr.com/4c20bbd45ec1d9dbd48a78035abb52e3/e8ace5742530bdc8-0b/s250x400/cc6ab879ee516214d50f2ca015e5f4dad13fb7a4.jpg 250w, https://64.media.tumblr.com/4c20bbd45ec1d9dbd48a78035abb52e3/e8ace5742530bdc8-0b/s400x600/b29ecd7cd83accb95fb9cd5b496185f4e083c567.jpg 400w, https://64.media.tumblr.com/4c20bbd45ec1d9dbd48a78035abb52e3/e8ace5742530bdc8-0b/s500x750/f0beb37cbe81e8041ad02a6a5ff1dac86a22c4b5.jpg 500w, https://64.media.tumblr.com/4c20bbd45ec1d9dbd48a78035abb52e3/e8ace5742530bdc8-0b/s540x810/e769517a3f68b0a64decfc5189e1731b96eea48a.jpg 540w, https://64.media.tumblr.com/4c20bbd45ec1d9dbd48a78035abb52e3/e8ace5742530bdc8-0b/s640x960/dc7f617d89762b3a1f30754efd365f0f8fb1997a.jpg 640w, https://64.media.tumblr.com/4c20bbd45ec1d9dbd48a78035abb52e3/e8ace5742530bdc8-0b/s1280x1920/770d2bd2298314d452bbad29cac206e8a1ab1818.jpg 969w  sizes= (max-width: 969px) 100vw, 969px ></figure></div>  “We are elves, too. ”   “Hello, friend! ”   “No way! ”  ",
        "comments": [
            "See, that's the thing I like about TES elves is that they're fucken.. weird. Like I think it's a thing that tolkien got across in the LOTR books but kind of get lost in the movies is that elves are pretty, but not, yknow hot? They're supposed to be aesthetically beautiful but in sort of an alien way.  It's def important to avoid caricatures of irl cultures and races ofc but the exaggeration that is present in tes (to a lesser extent oblivion) really just makes the world a lot spicier and it's...",
            "And in both Elves are genocidal bastards XD",
            "Don ’t forget the elves from the lord of the rings  \ud83d \udc4c \ud83c \udffc \ud83e \udd70",
            "The elves are beautiful \ud83d \ude0b \ud83d \ude0b ❤ ️"
        ]
    },
    {
        "thread": " <div class= npf_row ><figure class= tmblr-full  data-orig-height= 2048  data-orig-width= 1536 ><img src= https://64.media.tumblr.com/1b329d618d7f0ec5f7aa6877c97271d4/e11eb1d15098cd08-7a/s640x960/f5fe74b33d1122d20e9b2fc5404bf107bbdb7088.jpg  data-orig-height= 2048  data-orig-width= 1536  srcset= https://64.media.tumblr.com/1b329d618d7f0ec5f7aa6877c97271d4/e11eb1d15098cd08-7a/s75x75_c1/5d0f57e3faac47a108e8bef7b8d00401571c19eb.jpg 75w, https://64.media.tumblr.com/1b329d618d7f0ec5f7aa6877c97271d4/e11eb1d15098cd08-7a/s100x200/cb56ab8d328a89c3dd1c4a2d95f52179f1a9eafe.jpg 100w, https://64.media.tumblr.com/1b329d618d7f0ec5f7aa6877c97271d4/e11eb1d15098cd08-7a/s250x400/d5619b7872c3212725fdbc508aea18cdf277eb12.jpg 250w, https://64.media.tumblr.com/1b329d618d7f0ec5f7aa6877c97271d4/e11eb1d15098cd08-7a/s400x600/e6027732ea373298e8f59efea4e94176cdc91f8e.jpg 400w, https://64.media.tumblr.com/1b329d618d7f0ec5f7aa6877c97271d4/e11eb1d15098cd08-7a/s500x750/fe307dc0775df012e3ce1590b3d204044e73cd38.jpg 500w, https://64.media.tumblr.com/1b329d618d7f0ec5f7aa6877c97271d4/e11eb1d15098cd08-7a/s540x810/171f83692e8eed1ec97b788360a70823eeb35bae.jpg 540w, https://64.media.tumblr.com/1b329d618d7f0ec5f7aa6877c97271d4/e11eb1d15098cd08-7a/s640x960/f5fe74b33d1122d20e9b2fc5404bf107bbdb7088.jpg 640w, https://64.media.tumblr.com/1b329d618d7f0ec5f7aa6877c97271d4/e11eb1d15098cd08-7a/s1280x1920/09a671c207e2a37f47d47c4c8e4ab35bf3d6ea39.jpg 1280w, https://64.media.tumblr.com/1b329d618d7f0ec5f7aa6877c97271d4/e11eb1d15098cd08-7a/s2048x3072/a8f91c568c25141100cc675ba38d8efdf453cbd3.jpg 1536w  sizes= (max-width: 1280px) 100vw, 1280px ></figure></div> Farkas told me to go fistfight a man, so I decided to make myself a small advantage   \ud83d \ude0e  ",
        "comments": [
            "Im begging you how did you get it so high, im lv100 in enchanting and still nothing",
            "FALCON....PAAAAWNCH",
            "@amelonboi ",
            "How do you get such a high number?",
            "Posts I want to send to Steven ",
            "About 1500 in the enchanting skill and a filled grand soul gem",
            "How … how does one do this? ",
            "YESS he uses this for his unarmed build  \ud83d \ude02 \ud83e \udd23",
            "@devil-doll13  \ud83e \udd23Max would absolutely have this in Skyrim."
        ]
    },
    {
        "thread": "  Arvel the Swift! <div class= npf_row ><figure class= tmblr-full  data-orig-height= 1890  data-orig-width= 1967 ><img src= https://64.media.tumblr.com/a00606abca8550d3d176dcc39e9f30f7/353a6b90be312919-2f/s640x960/52da7879beaffdfbb95fe29609080191ba0ef5a7.png  data-orig-height= 1890  data-orig-width= 1967  srcset= https://64.media.tumblr.com/a00606abca8550d3d176dcc39e9f30f7/353a6b90be312919-2f/s75x75_c1/4b1a939188c4993428232bb4c33bc9e65ce4f7fc.png 75w, https://64.media.tumblr.com/a00606abca8550d3d176dcc39e9f30f7/353a6b90be312919-2f/s100x200/beb6426682a49e71f8f13b7950ce07b1adc38f1f.png 100w, https://64.media.tumblr.com/a00606abca8550d3d176dcc39e9f30f7/353a6b90be312919-2f/s250x400/7ba4f7d1b73b6d0d56fbeb6da61fea69505cfe9e.png 250w, https://64.media.tumblr.com/a00606abca8550d3d176dcc39e9f30f7/353a6b90be312919-2f/s400x600/ff3e4cec2e2cf9906c3df35c8c4229a3ad2de526.png 400w, https://64.media.tumblr.com/a00606abca8550d3d176dcc39e9f30f7/353a6b90be312919-2f/s500x750/c14ea94e03720238757dca4c98b032af21bc6deb.png 500w, https://64.media.tumblr.com/a00606abca8550d3d176dcc39e9f30f7/353a6b90be312919-2f/s540x810/c0382058e02e7016ab76a6867686811244464e6b.png 540w, https://64.media.tumblr.com/a00606abca8550d3d176dcc39e9f30f7/353a6b90be312919-2f/s640x960/52da7879beaffdfbb95fe29609080191ba0ef5a7.png 640w, https://64.media.tumblr.com/a00606abca8550d3d176dcc39e9f30f7/353a6b90be312919-2f/s1280x1920/f2eff97650f0b0aff0d05fcb436607a7eff39611.png 1280w, https://64.media.tumblr.com/a00606abca8550d3d176dcc39e9f30f7/353a6b90be312919-2f/s2048x3072/771d4141fa1509a9b8352368bd81f3d123257017.png 1967w  sizes= (max-width: 1280px) 100vw, 1280px ></figure></div> Here ’s the immediate aftermath of that picture, btw: <figure class= tmblr-full  data-orig-height= 692  data-orig-width= 720  data-npf='{ type : video , provider : tumblr , url : https://va.media.tumblr.com/tumblr_rqcmtkSfAl1a0i9gt.mp4 , media :{ url : https://va.media.tumblr.com/tumblr_rqcmtkSfAl1a0i9gt.mp4 , type : video/mp4 , width :720, height :692}, poster :[{ url : https://64.media.tumblr.com/tumblr_rqcmtkSfAl1a0i9gt_frame1.jpg , type : image/jpeg , width :720, height :692}], filmstrip :{ url : https://64.media.tumblr.com/previews/tumblr_rqcmtkSfAl1a0i9gt_filmstrip.jpg , type : image/jpeg , width :2000, height :192}}'><video controls= controls  autoplay= autoplay  muted= muted  poster= https://64.media.tumblr.com/tumblr_rqcmtkSfAl1a0i9gt_frame1.jpg ><source src= https://va.media.tumblr.com/tumblr_rqcmtkSfAl1a0i9gt.mp4  type= video/mp4 ></source></video></figure> ",
        "comments": [
            " Nothing bad ever happens to the Kennedys! ",
            "the amount of health I went through to stop him from walking into these goddamned traps",
            "The 1st time i play skyrim i had to go back across the dungeon just to get the key from his unalive body",
            "The draugr just laying there like:",
            "Somebody edit this with cartoon sound effects pls",
            "arvel the yeeted",
            "swiftly flying though the air"
        ]
    },
    {
        "thread": " <div class= npf_row ><figure class= tmblr-full  data-orig-height= 445  data-orig-width= 600 ><img src= https://64.media.tumblr.com/f4c5d9354ef32787d7deba857e1a0483/5579895fd7c24b91-c2/s640x960/82ec00499bb4969cc8fff4b5d6be12f5e7be4943.jpg  data-orig-height= 445  data-orig-width= 600  srcset= https://64.media.tumblr.com/f4c5d9354ef32787d7deba857e1a0483/5579895fd7c24b91-c2/s75x75_c1/8d8d7f0bcbb18adf87aab0f88d5b0eccd13277ea.jpg 75w, https://64.media.tumblr.com/f4c5d9354ef32787d7deba857e1a0483/5579895fd7c24b91-c2/s100x200/ec9259cc07e8a5bc202e1d60c59324dc3ac38a7c.jpg 100w, https://64.media.tumblr.com/f4c5d9354ef32787d7deba857e1a0483/5579895fd7c24b91-c2/s250x400/60fc74f12f63b42f896eb74d8f6b0ac7efe37446.jpg 250w, https://64.media.tumblr.com/f4c5d9354ef32787d7deba857e1a0483/5579895fd7c24b91-c2/s400x600/654c7ed8be04a3d7cc1f7c6a578fda0805cf3999.jpg 400w, https://64.media.tumblr.com/f4c5d9354ef32787d7deba857e1a0483/5579895fd7c24b91-c2/s500x750/cb29c3744dc2a474c2c93e76e12c1db0ea21f9b3.jpg 500w, https://64.media.tumblr.com/f4c5d9354ef32787d7deba857e1a0483/5579895fd7c24b91-c2/s540x810/8f68fc1387901ec8c61366a001ede88088ec2923.jpg 540w, https://64.media.tumblr.com/f4c5d9354ef32787d7deba857e1a0483/5579895fd7c24b91-c2/s640x960/82ec00499bb4969cc8fff4b5d6be12f5e7be4943.jpg 600w  sizes= (max-width: 600px) 100vw, 600px ></figure></div> ",
        "comments": [
            "GOLD DIAMOND RING OF WHAT?????? ",
            "OP what in the fuck is this",
            "Does this mean your spoo does more damage on hitting somebody or does your willy get chafed worse? ",
            " \ud83e \udee4",
            "Me walking around like this  "
        ]
    },
    {
        "thread": " <div data-npf= {&quot;type&quot;:&quot;poll&quot;,&quot;client_id&quot;:&quot;fa7d10ba-6634-4d6c-87c6-cac8067574e5&quot;,&quot;question&quot;:&quot;Which type of game did you play so hard, you hurt yourself (i.e. you play until your brain stops or your tendons go on strike)?&quot;,&quot;answers&quot;:[{&quot;client_id&quot;:&quot;41bb6680-af6d-44d1-ac3d-890d56dc0dbb&quot;,&quot;answer_text&quot;:&quot;Farm/Life sim (e.g. Stardew Valley, The Sims)&quot;},{&quot;client_id&quot;:&quot;ab859be7-bd61-4043-9031-38db5e1f131f&quot;,&quot;answer_text&quot;:&quot;Action adventure (e.g. LoZ, Assassin's Creed)&quot;},{&quot;client_id&quot;:&quot;117beeb5-4378-4cd1-8f15-795860029529&quot;,&quot;answer_text&quot;:&quot;Shooter (e.g. Halo, Gears of War)&quot;},{&quot;client_id&quot;:&quot;b2f4024d-bc46-4407-8308-dd5073b87de6&quot;,&quot;answer_text&quot;:&quot;Puzzler (e.g. Portal 2)&quot;},{&quot;client_id&quot;:&quot;57b3b69c-d23c-44e4-acbc-4c1143472868&quot;,&quot;answer_text&quot;:&quot;RPG (e.g. Skyrim)&quot;},{&quot;client_id&quot;:&quot;190550ab-984d-4f87-9dc6-2256ae1b5a0c&quot;,&quot;answer_text&quot;:&quot;MOBA/RTS (e.g. LoL, Age of Empires)&quot;},{&quot;client_id&quot;:&quot;35526e63-2820-4013-a8c9-f7987672d183&quot;,&quot;answer_text&quot;:&quot;Tabletop RPG (e.g. D&amp;D)&quot;},{&quot;client_id&quot;:&quot;550314cc-6f1d-4f0e-9a3e-795030fc82b0&quot;,&quot;answer_text&quot;:&quot;Boardgame/dice/cards (just like it sounds)&quot;},{&quot;client_id&quot;:&quot;e23a68ea-ca78-4730-aa9d-08c0444076ae&quot;,&quot;answer_text&quot;:&quot;I play 'em all 'til I drop&quot;}],&quot;settings&quot;:{&quot;multiple_choice&quot;:false,&quot;close_status&quot;:&quot;closed-after&quot;,&quot;expire_after&quot;:604800,&quot;source&quot;:&quot;tumblr&quot;}}  class= poll-post ><p class= poll-question >Which type of game did you play so hard, you hurt yourself (i.e. you play until your brain stops or your tendons go on strike)? <a href= https://www.tumblr.com/blog/view/decorum-video-games/713082259527401472  rel= nofollow  class= poll-row > Farm/Life sim (e.g. Stardew Valley, The Sims)  <a href= https://www.tumblr.com/blog/view/decorum-video-games/713082259527401472  rel= nofollow  class= poll-row > Action adventure (e.g. LoZ, Assassin ’s Creed)  <a href= https://www.tumblr.com/blog/view/decorum-video-games/713082259527401472  rel= nofollow  class= poll-row > Shooter (e.g. Halo, Gears of War)  <a href= https://www.tumblr.com/blog/view/decorum-video-games/713082259527401472  rel= nofollow  class= poll-row > Puzzler (e.g. Portal 2)  <a href= https://www.tumblr.com/blog/view/decorum-video-games/713082259527401472  rel= nofollow  class= poll-row > RPG (e.g. Skyrim)  <a href= https://www.tumblr.com/blog/view/decorum-video-games/713082259527401472  rel= nofollow  class= poll-row > MOBA/RTS (e.g. LoL, Age of Empires)  <a href= https://www.tumblr.com/blog/view/decorum-video-games/713082259527401472  rel= nofollow  class= poll-row > Tabletop RPG (e.g. D&amp;D)  <a href= https://www.tumblr.com/blog/view/decorum-video-games/713082259527401472  rel= nofollow  class= poll-row > Boardgame/dice/cards (just like it sounds)  <a href= https://www.tumblr.com/blog/view/decorum-video-games/713082259527401472  rel= nofollow  class= poll-row > I play  ‘em all 'til I drop  </div> I n the tags, tell me which game(s) and what hurts (and would you do it again). Please reblog - thanks!  For me, I played botw, acnh, and stardew until my thumb tendons threatened to explode. I ’ll probs do it again lol  ",
        "comments": [
            "Why are MOBA and RTS together? They are very different vibes imo. And why RTS but not TBS. I'm even more likely to play TBS for about 30 hours straight.",
            "Stardew valley, the Sims",
            "All of these options describe the Fallout series",
            "Rhythm games, especially Cytus",
            "Recently lost quite a bit of sleep over Inside by Playdead -- not as much from playing as from processing the story.  Also cried over it twice.",
            "fucking minesweeper"
        ]
    },
    {
        "thread": " <div class= npf_row ><figure class= tmblr-full  data-orig-height= 372  data-orig-width= 640 ><img src= https://64.media.tumblr.com/82259cca967987c631306145212fd128/0f3928c5d17ca746-b3/s640x960/89d960e291c53f323c50127d5aa5efb8dfcce288.png  data-orig-height= 372  data-orig-width= 640  srcset= https://64.media.tumblr.com/82259cca967987c631306145212fd128/0f3928c5d17ca746-b3/s75x75_c1/684f0a8d38b507d1c5c6e26bd1d962c45e25aed0.png 75w, https://64.media.tumblr.com/82259cca967987c631306145212fd128/0f3928c5d17ca746-b3/s100x200/a40cc5ddd8c0b5187ea0b4d2a53fb48165580eac.png 100w, https://64.media.tumblr.com/82259cca967987c631306145212fd128/0f3928c5d17ca746-b3/s250x400/8be1409bc800d482a5de00c02a4228a45b526e86.png 250w, https://64.media.tumblr.com/82259cca967987c631306145212fd128/0f3928c5d17ca746-b3/s400x600/1679cd3424b73d0e7646427460bd6675243cb17e.png 400w, https://64.media.tumblr.com/82259cca967987c631306145212fd128/0f3928c5d17ca746-b3/s500x750/819b2e215aeb6bcd316520c34ac2351747ac5900.png 500w, https://64.media.tumblr.com/82259cca967987c631306145212fd128/0f3928c5d17ca746-b3/s540x810/05ba90aca16d7665ef3a3f85496146c0485a90d1.png 540w, https://64.media.tumblr.com/82259cca967987c631306145212fd128/0f3928c5d17ca746-b3/s640x960/89d960e291c53f323c50127d5aa5efb8dfcce288.png 640w  sizes= (max-width: 640px) 100vw, 640px ></figure></div> ",
        "comments": [
            "true",
            "erm … that item is actually labeled as human flesh, its an alchemy ingredient  \ud83e \udd13",
            " د ه  ح ر ف ي ً ا  أ ن ا",
            "@moosemoss6214 "
        ]
    },
    {
        "thread": " With the reposting of my other sketches on pinterest, I am in the need of redoing it all with signatures.    Human: Being more close to the vanilla skyrim werewolf but coming in many more colors and fur textures. These creatures of shorter more box like muzzles unlike the wolves. Ears are pointed and covered in a finer fur. The human type werewolves can be 7ft to 8ft while upright on average but size can vary. ",
        "comments": [
            "Khajiit: Like the Argonian the wolf part of the werewolf curse is not as strong. Bringing out the wilder, more beastial part of the beast race instead. The Khajiit become more like a lynx, almost lion creature. Paws become much bigger, claws much longer and still retractable. Being stealth hunters like the elves, but being stronger and more effective on their own. Also they scream. Not howl. Lynx ’s scream and its terrifying.",
            "Argonian: The werewolf blessing/curse takes a different turn for Argonians. Bringing out their more feral side, their horns growing, feathers sprouting all over their bodies and growing twice in size being one of the largest werewolf variants in the group. Being more reptilian in nature, these cold blooded cursed beings are sluggish at night and are known to be on their fours like a giant monsterous crocodile.  ",
            "Elf: These lycans are sleek, ambush hunters, imagine a borzai hound with thumbs. Depending on the type of elf that has become a werewolf, their appearances and type of fur changes. High elves have soft almost wavy fur that comes in those typical lighter colors, wood elves while their fur is shorter and having a mixture of coarse and soft, and Dark elves have a thicker softer layered coat. Elf werewolves are sharper in skull shape and are not as built as humans nor orcs but are the same size of...",
            "Orc: A orc werewolf will be noted on it ’s size and the structure of it ’s head. With a big overbite, a stronger larger jaw than the human werewolf, this werewolf can crush and bite through bone. These lycan is also known for it ’s size and thick bristly fur. They also are not known for howling, and give out more of a roar than a howl. Also these lycans have a stronger pack bond as well. Their average size is between 8ft to 9ft but they can grow bigger."
        ]
    },
    {
        "thread": " We can all be honest. Serana isn ’t cool and mysterious. People think of her that way just cause she ’s a vampire. She ’s a little pathetic loser girl. A nerd who is clumsy and awkward with everyone whilst trying to act cool.   And I love her for it. It ’s my favorite thing about her as a character. ",
        "comments": [
            "Had me on the first half ngl",
            "She's gonna be the reason why I might play Skyrim",
            "@ghostfacedbat the weird lil creacher we all love",
            "REAL you get me you get my Serana. i think she might try but at heart she's just a Creature (deeply affectionate)"
        ]
    },
    {
        "thread": " <div class= npf_row ><figure class= tmblr-full  data-orig-height= 352  data-orig-width= 640 ><img src= https://64.media.tumblr.com/d6cfc7236606d33115cdffb1d8eb7a56/a88f26b65d22dcec-22/s640x960/3333831f50cf882b04050f0a3f5672dca2a3e730.gif  data-orig-height= 352  data-orig-width= 640  srcset= https://64.media.tumblr.com/d6cfc7236606d33115cdffb1d8eb7a56/a88f26b65d22dcec-22/s75x75_c1/47e978afd3b21dbc9f3570d710dc6efca51c085f.gif 75w, https://64.media.tumblr.com/d6cfc7236606d33115cdffb1d8eb7a56/a88f26b65d22dcec-22/s100x200/80fc087e0b763efb702b0668650b51b3ba0e72a9.gif 100w, https://64.media.tumblr.com/d6cfc7236606d33115cdffb1d8eb7a56/a88f26b65d22dcec-22/s250x400/90bd33ce3a3b3580f5cc36ec8e2ee07d983fd42c.gif 250w, https://64.media.tumblr.com/d6cfc7236606d33115cdffb1d8eb7a56/a88f26b65d22dcec-22/s400x600/a1de8c5469021286cf6929003d1e10ba4d86409c.gif 400w, https://64.media.tumblr.com/d6cfc7236606d33115cdffb1d8eb7a56/a88f26b65d22dcec-22/s500x750/bd0d955ffab3d9bcc66e5055abacb6aac91f2972.gif 500w, https://64.media.tumblr.com/d6cfc7236606d33115cdffb1d8eb7a56/a88f26b65d22dcec-22/s540x810/5f62b08db774b56a7f9ec1459e09593a733de293.gif 540w, https://64.media.tumblr.com/d6cfc7236606d33115cdffb1d8eb7a56/a88f26b65d22dcec-22/s640x960/3333831f50cf882b04050f0a3f5672dca2a3e730.gif 640w  sizes= (max-width: 640px) 100vw, 640px ></figure></div><div class= npf_row ><figure class= tmblr-full  data-orig-height= 300  data-orig-width= 500 ><img src= https://64.media.tumblr.com/c5b9497ffd368224b2e3d677301468fc/a88f26b65d22dcec-52/s640x960/2d4d8b176e3c65f230ec303c29c36e31aa2d8a98.gif  data-orig-height= 300  data-orig-width= 500  srcset= https://64.media.tumblr.com/c5b9497ffd368224b2e3d677301468fc/a88f26b65d22dcec-52/s75x75_c1/eaa92ec27074154c49ba10a0167f5e344fd086b2.gif 75w, https://64.media.tumblr.com/c5b9497ffd368224b2e3d677301468fc/a88f26b65d22dcec-52/s100x200/c5d38343223be3f4d0f2f583429537e65e4a5966.gif 100w, https://64.media.tumblr.com/c5b9497ffd368224b2e3d677301468fc/a88f26b65d22dcec-52/s250x400/e7fe081195613558711a7e68e4b7bf3294d003b6.gif 250w, https://64.media.tumblr.com/c5b9497ffd368224b2e3d677301468fc/a88f26b65d22dcec-52/s400x600/108c985ca9711daa14e6176e7450bcbbd05754aa.gif 400w, https://64.media.tumblr.com/c5b9497ffd368224b2e3d677301468fc/a88f26b65d22dcec-52/s500x750/83096e7db967a182655effae87631b7b58417184.gif 500w  sizes= (max-width: 500px) 100vw, 500px ></figure></div><div class= npf_row ><figure class= tmblr-full  data-orig-height= 338  data-orig-width= 600 ><img src= https://64.media.tumblr.com/5e2061a5ca0bfbd66961d30e39bed5fb/a88f26b65d22dcec-7c/s640x960/1a97b76d8401d0abd6b28c825baec6d0e1b4fa79.gif  data-orig-height= 338  data-orig-width= 600  srcset= https://64.media.tumblr.com/5e2061a5ca0bfbd66961d30e39bed5fb/a88f26b65d22dcec-7c/s75x75_c1/3503096d24cfb1b8b36fe555ac8e8fda7540ca1c.gif 75w, https://64.media.tumblr.com/5e2061a5ca0bfbd66961d30e39bed5fb/a88f26b65d22dcec-7c/s100x200/c4db4688ea0cab5e49802c1e9cbd17bdd0e14b1e.gif 100w, https://64.media.tumblr.com/5e2061a5ca0bfbd66961d30e39bed5fb/a88f26b65d22dcec-7c/s250x400/78e15e2363cbf2e39649c60e873313db8971f687.gif 250w, https://64.media.tumblr.com/5e2061a5ca0bfbd66961d30e39bed5fb/a88f26b65d22dcec-7c/s400x600/485b7c5ad3207fb77067a5a3c5e010e9d44ea330.gif 400w, https://64.media.tumblr.com/5e2061a5ca0bfbd66961d30e39bed5fb/a88f26b65d22dcec-7c/s500x750/8597a19fbf7dc2a96b8c882b10b01a219df5f276.gif 500w, https://64.media.tumblr.com/5e2061a5ca0bfbd66961d30e39bed5fb/a88f26b65d22dcec-7c/s540x810/357b4326a128a4850d46144b0f184489eac7f2fa.gif 540w, https://64.media.tumblr.com/5e2061a5ca0bfbd66961d30e39bed5fb/a88f26b65d22dcec-7c/s640x960/1a97b76d8401d0abd6b28c825baec6d0e1b4fa79.gif 600w  sizes= (max-width: 600px) 100vw, 600px ></figure></div><p class= npf_chat >scenery from my favorite game: skyrim ✨  ",
        "comments": [
            "Okay fine. I'll go play Skyrim again.",
            "Beautiful!",
            "woah, this is a game?!?",
            " ر ا ئ ع"
        ]
    },
    {
        "thread": " Okay, I ’m always finding out people I meet online had vastly different childhood gaming experiences, so I ’m curious: <div data-npf= {&quot;type&quot;:&quot;poll&quot;,&quot;client_id&quot;:&quot;28e87b4c-bcea-416d-b1b3-39a7cd23bf69&quot;,&quot;question&quot;:&quot;What kind of games did you have growing up?&quot;,&quot;answers&quot;:[{&quot;client_id&quot;:&quot;fece75bf-0be3-43fa-8821-8f5144b9b57c&quot;,&quot;answer_text&quot;:&quot;Mostly / only Nintendo&quot;},{&quot;client_id&quot;:&quot;9a4c722a-5bf2-45c2-83bc-baa9329ffec6&quot;,&quot;answer_text&quot;:&quot;Mostly / only PS or XBox&quot;},{&quot;client_id&quot;:&quot;c8ef94f8-bd89-4ce8-9e53-00e9e9307be2&quot;,&quot;answer_text&quot;:&quot;Mostly / only a different console  — Sega, Atari etc&quot;},{&quot;client_id&quot;:&quot;b847e083-7054-49e1-984e-2f119abc02cb&quot;,&quot;answer_text&quot;:&quot;Mostly / only PC  — and I usually played mainstream releases&quot;},{&quot;client_id&quot;:&quot;cb7c75ea-022e-47f4-b433-2ab484af54de&quot;,&quot;answer_text&quot;:&quot;Mostly / only PC  — and I usually played indie games&quot;},{&quot;client_id&quot;:&quot;aca69f3b-3baa-4d28-8e38-eaa891a69067&quot;,&quot;answer_text&quot;:&quot;More than one console but no PC (say which consoles in the notes)&quot;},{&quot;client_id&quot;:&quot;0e334e14-d03c-442b-b059-7b29ca09ab75&quot;,&quot;answer_text&quot;:&quot;More than one console AND PC (say which in the notes)&quot;},{&quot;client_id&quot;:&quot;ff77ee31-1328-459a-a007-8edbe884ed81&quot;,&quot;answer_text&quot;:&quot;I mostly / only played arcade games growing up&quot;},{&quot;client_id&quot;:&quot;63b83bfd-5d43-42ea-af3e-b471f86fcaab&quot;,&quot;answer_text&quot;:&quot;Other options not mentioned (please list in notes!)&quot;},{&quot;client_id&quot;:&quot;38b9054b-a0b9-4479-af8f-0c2b8e025246&quot;,&quot;answer_text&quot;:&quot;I didn't grow up with video games / only got into them later&quot;}],&quot;settings&quot;:{&quot;multiple_choice&quot;:false,&quot;close_status&quot;:&quot;closed-after&quot;,&quot;expire_after&quot;:86400,&quot;source&quot;:&quot;tumblr&quot;}}  class= poll-post ><p class= poll-question >What kind of games did you have growing up? <a href= https://www.tumblr.com/blog/view/decorum-video-games/712528960043499520  rel= nofollow  class= poll-row > Mostly / only Nintendo  <a href= https://www.tumblr.com/blog/view/decorum-video-games/712528960043499520  rel= nofollow  class= poll-row > Mostly / only PS or XBox  <a href= https://www.tumblr.com/blog/view/decorum-video-games/712528960043499520  rel= nofollow  class= poll-row > Mostly / only a different console  — Sega, Atari etc  <a href= https://www.tumblr.com/blog/view/decorum-video-games/712528960043499520  rel= nofollow  class= poll-row > Mostly / only PC  — and I usually played mainstream releases  <a href= https://www.tumblr.com/blog/view/decorum-video-games/712528960043499520  rel= nofollow  class= poll-row > Mostly / only PC  — and I usually played indie games  <a href= https://www.tumblr.com/blog/view/decorum-video-games/712528960043499520  rel= nofollow  class= poll-row > More than one console but no PC (say which consoles in the notes)  <a href= https://www.tumblr.com/blog/view/decorum-video-games/712528960043499520  rel= nofollow  class= poll-row > More than one console AND PC (say which in the notes)  <a href= https://www.tumblr.com/blog/view/decorum-video-games/712528960043499520  rel= nofollow  class= poll-row > I mostly / only played arcade games growing up  <a href= https://www.tumblr.com/blog/view/decorum-video-games/712528960043499520  rel= nofollow  class= poll-row > Other options not mentioned (please list in notes!)  <a href= https://www.tumblr.com/blog/view/decorum-video-games/712528960043499520  rel= nofollow  class= poll-row > I didn ’t grow up with video games / only got into them later  <a href= https://www.tumblr.com/blog/view/decorum-video-games/712528960043499520  rel= nofollow  class= poll-see-results >See Results </div> Feel free to put your favourite consoles or specific games / franchises in the notes, too! And reblog for sample size etc etc ",
        "comments": [
            "The Wii.",
            "My dad had a pc and the kids had various PlayStations across the years",
            "OK, here's where I show my age",
            "i played on a wii, xbox 360, and ds as a kid. loved the hell out of the mario games on the wii (except for new smb lol), and viva pi ñata and banjo kazooie nuts and bolts on the xbox. on ds i mostly played pokemon games, mainly gen 4 and pokemon sapphire",
            "Wow unexpected results  \ud83e \udd2f",
            "PS2, PS3, Xbox 360 and my grandfather's old Dell notebook (played a lot of MMO's with it)",
            "This is edutainment CD erasure"
        ]
    },
    {
        "thread": "  “I wish I could make a game but get other people to do all the art and writing and programming and ” you literally can. It ’s called being the project manager, and all you have to do to get this job is be willing to write all the emails, make all the phone calls, set up and moderate all the group chats, schedule and lead all the meetings, monitor and follow up on all the deadlines, coordinate with all relevant third parties, and personally chase down the answer to every question that anyone might conceivably ask about anything. If that sounds like your idea of a good time, there are any number of projects that would <b>love</b> to have you on board. ",
        "comments": [
            "How do I find that, especially as a minor",
            "People don't quit bad jobs, they quit bad managers. I have quit at least one PM.",
            "This is true in any field and as a people manager, I can say that you must also be comfortable with minor disdain from your team. Some creative types are seriously adverse to being cat-herded. You need to be flexible to their needs but willing to stand firm and be the  adult  in the room when the group is getting off course. ",
            "I'm also a little freak who enjoys organizing work stuff! It's not boring to me, it's fun going from point A to B!And there's clear instructions unlike other jobs"
        ]
    },
    {
        "thread": " I love you Stardew Valley I love you Stray I love you Untitled Goose Game I love you indie games with no microtransactions that understand having fun is the whole, entire point. ",
        "comments": [
            "Check out A Short Hike, it's a small and lovely game. It helped me get out of a really bad (mental) place",
            "I need to finish Lost Ember before I get Stray, but yeah.",
            "BATIM & BATDR <]",
            "I love you Project Wingman"
        ]
    },
    {
        "thread": " <div data-npf= {&quot;type&quot;:&quot;poll&quot;,&quot;client_id&quot;:&quot;99d78573-57e9-40d9-b2fd-43c16a7e37f0&quot;,&quot;question&quot;:&quot;Has a videogame ever made you cry?&quot;,&quot;answers&quot;:[{&quot;client_id&quot;:&quot;ec5ccc5c-9252-4e22-963b-21133ecd262d&quot;,&quot;answer_text&quot;:&quot;No&quot;},{&quot;client_id&quot;:&quot;528c72ef-b0b0-495a-bd91-cc7b9aad80b8&quot;,&quot;answer_text&quot;:&quot;No but I've come pretty close&quot;},{&quot;client_id&quot;:&quot;23b225df-1111-40b1-b5da-632c48b37199&quot;,&quot;answer_text&quot;:&quot;;_; (name the game/s in the tags)&quot;}],&quot;settings&quot;:{&quot;multiple_choice&quot;:false,&quot;close_status&quot;:&quot;closed-after&quot;,&quot;expire_after&quot;:604800,&quot;source&quot;:&quot;tumblr&quot;}}  class= poll-post ><p class= poll-question >Has a videogame ever made you cry? <a href= https://www.tumblr.com/blog/view/decorum-video-games/712528893753671680  rel= nofollow  class= poll-row > No  <a href= https://www.tumblr.com/blog/view/decorum-video-games/712528893753671680  rel= nofollow  class= poll-row > No but I ’ve come pretty close  <a href= https://www.tumblr.com/blog/view/decorum-video-games/712528893753671680  rel= nofollow  class= poll-row > ;_; (name the game/s in the tags)  </div> ",
        "comments": [
            "I pressed the wrong option ;-;",
            "The Last of Us for sure (when I was working on Part 1 and doing QA on the Henry and Sam scene? Oof), The Last of Us Part 2, Life is Strange, Super Mario Galaxy (don't judge), Hades, Tell Me Why, This War of Mine, and Undertale to name a few, but I guarantee there are more.",
            "To many games have made me cry I'm a goddamned little bitch",
            " …Yeah"
        ]
    },
    {
        "thread": " I didn ’t back the  Friday Night Funkin ’  Kickstarter, but I ’ve been casually following the dev blog, and it ’s kind of entertaining how every few months they ’re like  “hey, we ’ve been working on this thing for multiple years, and just last week we figured out that [insert basic tenet of project management here] ”.  Like, the transparency is great, and at least they <b>are</b> figuring this stuff out, which is more than can be said for most indie game projects, but holy fuck, these dudes raised  2.2 million dollars  and spent the next two years re-inventing project management fundamentals from first principles. They could have saved themselves a lot of trouble, is what I mean to say! ",
        "comments": [
            "could be worse. could be yandere dev. AT LEAST they're making a game that is playable and enjoyable rather than... that",
            "By every metric I've cared to examine them by, the majority of game devs are shockingly bad at their jobs and ill prepared for the tasks they perform constantly.",
            "@bitternest That is not what the term project management means in this context.",
            "I get where you're coming from here, but consider: the most widely accepted and easily accessed source for  project management fundamentals  is Atlassian.",
            "Any resources you would recommend to learn project management fundamentals the non hard way?",
            "Gives me some level of hope that my projects will fund if I can reach enough folks."
        ]
    },
    {
        "thread": " <figure class= tmblr-full  data-orig-height= 487  data-orig-width= 650 ><img src= https://64.media.tumblr.com/9143e589c4dd27655bb4d5917c732dad/2aea99add1fa4cee-73/s540x810/8736a1a792bf3e74dadfd5954022e7df1e7bf327.jpg  data-orig-height= 487  data-orig-width= 650 ></figure> ",
        "comments": [
            "Make it double!",
            "@black-cat-babe ",
            "To unite all peoples within our nation",
            "And Make It Double",
            "*devastation",
            "To protect the world from devestatiom",
            "DRILL ARTIST & DRILL PRODUCER | ",
            "A",
            " HEY WHERE'S THE DOUBLE BALLOON WE HIRED? ",
            "To protect the world from devastation",
            "And make it double",
            "Make it Double! ",
            "A balloon like that is just begging for a comical puncture  \ud83d \ude05"
        ]
    },
    {
        "thread": " Sometimes I feel like indie game developers are taking the wrong lessons away from certain popular titles. Like, if your game ’s elaborate branching narrative has a dozen different endings, but it ’s possible to unwittingly screw yourself out of ever being able to access half of them as early as the first hour of play simply by visiting major locations out of the developer-intended order (in what is ostensibly an open world game), and the other half are gated behind NPC interactions where not only do you need to say exactly the right things based on information your character couldn ’t possibly possess, but the conditions for triggering those conversations in the first place are so fiddly that players literally had to decompile the game ’s code just to write a reliable walkthrough, that doesn ’t make your story deep, it just makes it obtuse. ",
        "comments": [
            "I feel like this is about a specific game. i've never had this experience and i play a pretty wide range of indie games",
            "thats real life too  \ud83d \ude14",
            "I want a game where the easiest to achieve ending is labeled as the  true ending  and has the most fitting narrative conclusion. All the other endings are labeled  false endings , are deliberatly obtuse to achieve, and are narratively speaking incredibly stupid.",
            "@tumblbeetuna thought that too.",
            "Video games where you have no idea what your goal is until you meet some secret NPC.",
            "Hot take: games with numerous endings are, many times, useless. ",
            "Elden Ring but with less resources to figure out how to make endings happen.",
            "I feel like as the internet becomes ever more omnivorous, we kinda forget that the puzzles in games should be directed towards the single user in their chair, and not towards the internet masses.   I don ’t think the  “lock you out in the 1st half hour ” is the bad design choice there; I think it not being fairly obvious after your first playthrough what needs figuring out, if not what needs doing is the design flaw.   But developers seem to be developing for forums and userbases to figure out from...",
            "I don't know what specific game op was thinking of, but this reminds me of my experience with Undertale. First off, I want to clarify that I like Undertale, and I am not at all saying that it's a bad game",
            "I think Undertale has the best different ending system",
            "real",
            "ideally someone should be able to stumble on it in a 'well what if I just name my character the same as their secret amnesiac past? will the game respond at all? lol' sort of way.",
            "like, if there's a 'using information your character can't possibly have' ending, it should be relatively straightforward once you actually have that information.",
            "Im...trying to u derstand the point being made here. Like, if the game has multiple endings you will lock yourself out of every single one of them except for one by the end. Just by having branching storylines you will inevitably lock certain part.out by the end.",
            "I am intrigued",
            "This reminds me of your previous post about a dating sim being unwinnable because of a programming oversight what made horses capable of jealousy.",
            "This has always been my biggest gripe with Dark Souls/Bloodborne/Elden Ring. Oh I missed talking to Threndibold, The Blood Merchant because they were blending into the mud in the corner of a dark room? Well they ’re dead now because I killed Victor, Lord of Goo and I ’m locked out of an entire quest line. Oh well, I can always make another character and play the whole game over again",
            "Alot of fujoshi games do this and it's kind of annoying",
            "I am so excited for the hopefully inevitable era of game developers being able to learn from the past.",
            "@kitten-cab00dle i mean usually there's a default [often bad] ending for if literally no requirements are met, if the devs forgot to add one then that's on them",
            "...oh look, it ’s why I was wary about getting into any story with a plot! (And why I love No Man ’s Sky, you can trip yourself up a bit, but no amount of wandering off will kill the plot/main quest.)"
        ]
    },
    {
        "thread": " <div class= npf_row ><figure class= tmblr-full  data-orig-height= 1800  data-orig-width= 1070 ><img src= https://64.media.tumblr.com/c42e27fe6d17dea333b60996c5c68f07/ea1729a0137b81ef-6c/s640x960/5333ee80e209712eb069a911aa2108e44c419c11.png  data-orig-height= 1800  data-orig-width= 1070  srcset= https://64.media.tumblr.com/c42e27fe6d17dea333b60996c5c68f07/ea1729a0137b81ef-6c/s75x75_c1/1a94fdabb42a964670434e0b3de3fc7c771d281c.png 75w, https://64.media.tumblr.com/c42e27fe6d17dea333b60996c5c68f07/ea1729a0137b81ef-6c/s100x200/ec9f85efca054eff23653a49e9944c9ff4fc9ebd.png 100w, https://64.media.tumblr.com/c42e27fe6d17dea333b60996c5c68f07/ea1729a0137b81ef-6c/s250x400/3a9ad719cca11871be4ecf2749f23cccea630bfc.png 238w, https://64.media.tumblr.com/c42e27fe6d17dea333b60996c5c68f07/ea1729a0137b81ef-6c/s400x600/0d0aa84651312e5f62245f48b772ae6f3fb52e46.png 357w, https://64.media.tumblr.com/c42e27fe6d17dea333b60996c5c68f07/ea1729a0137b81ef-6c/s500x750/ec5ff77bc2df61293b547562d728afc74ea749ec.png 446w, https://64.media.tumblr.com/c42e27fe6d17dea333b60996c5c68f07/ea1729a0137b81ef-6c/s540x810/a1b04e2c83d05e13eb6a3f399345c656d6a41ccc.png 482w, https://64.media.tumblr.com/c42e27fe6d17dea333b60996c5c68f07/ea1729a0137b81ef-6c/s640x960/5333ee80e209712eb069a911aa2108e44c419c11.png 571w, https://64.media.tumblr.com/c42e27fe6d17dea333b60996c5c68f07/ea1729a0137b81ef-6c/s1280x1920/0087f7d167d28466cfc6a4be4f2235b9bedecd29.png 1070w  sizes= (max-width: 1070px) 100vw, 1070px ></figure></div> Yelan and Shenhe, from Genshin Impact. New entry to the gym series.  ",
        "comments": [
            "  https://getyourtools.app/farhan",
            "sCReAmInG  PleAsE hElp",
            "Hi I'm searching for a sugar baby to take care of her needs, rents and pay her weekly allowance of $5,000, Do let me know if you're interested",
            " \ud83d \ude2b Ma'am please..... One chance.....",
            "@dxlucs ",
            "@hanmas @dottores LOOK AT OUR GIRLIES ",
            "When I say I just yelped Not only did I yelp my eyes popped out the socket ",
            "Sportswear and gorgeous fit gals.",
            "Fantasy characters in modern clothes like sportswear are good civilization. ",
            "glean is so cute there both adorable genshin grils and guys are so cute"
        ]
    },
    {
        "thread": " If you want to play a game as a wizard there ’s plenty of other options instead of that hp game:  Dragon Age  Forspoken (out next month, the magic combat system looks cool)  Ikenfell (a game centered around a magic school)  Wizard of legend  Any final fantasy game  I ’m sure there ’s more I don ’t know about ",
        "comments": [
            "The Elder Scrolls series (Skyrim is ported to every/almost every console anyway)",
            "Fable I & II, Dark Souls Trilogy,  Elder Scrolls: Oblivion/Skyrim and Mystik Belle to name a few.",
            "But in those games I can't make someone float helplessly while absolutely smacking them silly with spells and doing a twirly dance.",
            "Wizard of Legend is fun!!",
            "KINGDOMS OF AMALOR IS SO GOOD UGHH",
            "wizard 101",
            "Roughly a million different Minecraft mods to fit a whole pile of different magic types.",
            "ikenfell is sooooo good",
            "Elder Scrolls, Kingdoms of Alamour, Baldurs Gate, Fable, Etc. You right!",
            "Fable where you get more glowy blue tattoos the better you are at magic. Fable 2 is a personal favourite.",
            "The Elder Scrolls, simply because you can not only be a wizard but also a lizard.",
            "The Elder Scrolls A great variety of spells to use, and hundreds of videos on specific builds",
            "Dragon Quest ",
            "- Baldur's Gate (literally any of them i think but the 3rd one is almost fully out and is in early access right now and it's SO GOOD)  - fucking Wizards 101, it even has a magic school and shit  - Divinity Original Sin (i've heard 2 is the better of the 2 of them but i have not actually played either yet)  - Wildermyth   - Lichdom: Battlemage  - Spellbreak, which is just magic Fortnite   - I am counting the Witcher 3 because the magic system (both spells and alchemy related) fuck severely "
        ]
    },
    {
        "thread": " I went to Australia to meet one of my best friends. I got to pet his cats and play video games and then we went to the grocery store to buy snacks and make fun of his sister. ",
        "comments": [
            "Welcome back to  “POV you didn ’t read the username ”",
            "I've never felt more devastated reading the username",
            "@localwindmage this dream could be us",
            "Just a normal Tuesday my entity"
        ]
    },
    {
        "thread": " Game with hyper-detailed soulslike movement mechanics but it ’s about children playing tag. ",
        "comments": [
            "I want to play souls-borne-like games without combat, and this would be a great way to do it. I ’m a wuss about combat; playing tag is a better way to frame the objective.",
            "But that's just what playing tag felt like back then.",
            "Oh, yes, we can have SO MANY AESTHET|CS...",
            "with enough mods we can make this a reality."
        ]
    },
    {
        "thread": "  A good game, is a game you ’ve played twice.    A great game, is the one you lost count of.   Follow for more <b>Gamer Knowledge</b>.   ",
        "comments": [
            "Name 5 or 10 please.",
            "thank you gamer gosh",
            "wasn't crunchy enough ",
            "From a gamer to another.",
            "don ’t do this. you mustn ’t say these things."
        ]
    },
    {
        "thread": " The weirdest aspect about gaming culture ™ is seeing the number of people who shit on easy moders and those who skip certain parts of a game or who use accessibility features. Like …  they  bought that game, the console, and probably many other things, and they should worry about how you want them to play????  ",
        "comments": [
            "Almost certainly comes from souls games being  hard  which they're not, they're certainly challenging and reward you for learning how the game works but like they're not inherently fun for being hard for the sake of being hard",
            "Most gamers are just arrogant overgrown children who think they're better than others because they can play a game on a higher difficulty. It's not surprising at all. I mean, gamer culture was born from toxic masculinity after all.",
            "Easy moder here, can confirm I suck at video games",
            "@meepsanity autojump >>>>>>>>>>>>",
            "full admission. i keep mc auto jump on. catch me scaling hills with ease and not tiring out my thumb muscles",
            "The attitude we all need to have about gaming and other peoples' gaming needs/preferences ",
            "@vallshen we love to fucking see that !!!!! (heavy sarcasm)  good on the devs for doing that tho, almost no popular/known game even bothers with that istg"
        ]
    },
    {
        "thread": " so, are you emotionally attached to Far Cry 5 or are you a normal human being ",
        "comments": [
            " Н у  д а,  я,  а  к т о  о с у д и т",
            "It ’s like my soul at this point, buried into my freaking heart. It ’s so unhealthy but I play this game over and over again.",
            "This game has a serious death grip on me, like I ’m fuckin concerned for my sanity  \ud83d \udc80 \ud83d \ude2d",
            "im emotionally attached to the seeds is that worse",
            "emotionally attached, and I literally have attachment issues for this game. fc5 is the best game, with very complex characters and challenges, it completes me as a human. I do need help but I always go to fc5 for comfort <3",
            "I just got done playing it \ud83d \udc80",
            "I want to live in hope county. Where in America is there a place like hope county? Plz tell me so I can move there.",
            "its one of my comfort games to be honest. probably because of the familiar American setting and exploring with the folks i care about",
            "Far Cry 5 has filled a void in my life I never knew I had. Forgive me, I'm new to Tumblr  \ud83d \ude2c \ud83e \udd79",
            "@taejoonprk same  \ud83d \ude2d",
            "I legit stopped playing the game right before I had to kill John or Jacob and I haven ’t gone back soooooo no I don ’t think I ’m emotionally attached at all  \ud83d \ude01 \ud83d \ude04",
            "@swiftermidnights ​ truly who i am today & since release :("
        ]
    },
    {
        "thread": " When I die, I  wanna be buried hugging a ps2. Just saying.  ",
        "comments": [
            "True. It was a great console.",
            "wouldn ’t that be nice",
            "I was NOT expecting this to blow up like it did. It was just a dumb thing I said. I mean, I absolutely stand by it but this got way more traction than it had any right to",
            ".........so YuGiOh",
            "Or in a sarcophagus",
            "YES YES YES"
        ]
    },
    {
        "thread": " OMG you guys.       So tonight my husband and I decided to have Quality Time together by both playing Stardew Valley while sitting next to each other: me on my laptop and him on the xbox.       Which means, for the first time, I saw what the inside of his chests look like in SDV.  GUYS.   GUYS.       HE KEEPS EVERYTHING. And I don ’t mean ONE of everything.   I mean he has a chest of EGGS.   With all the eggs his animals produce.   Organized neatly.   HUNDREDS and HUNDREDS of eggs.   Just SITTING THERE.   IN THE CHEST.  HUNDREDS OF WOOL.   HUNDREDS OF MILKS.   CHESTS AND CHESTS of every FISH he ’s caught.   Chests of vegetables he ’s grown.  Me:   You …Don ’t Sell Them????  Him: Not often.  Me:   But …But …that ’s …the …POINT?      Well, I guess that ’s why you have no money …  What …exactly …is your plan?  Him: IDK.     Me: This …this is just …Hoarding Simulator.       So please …enjoy that I Found a New Type of Guy.   A Guy who Doesn ’t Sell Anything in Stardew Valley.  Also Me: So..are you a prepper?   Are you prepping for the virtual apocalypse?   Like  ‘these 300 void eggs are going to see me through Armageddon? ’   ",
        "comments": [
            "I do the same thing, I sell aged wine and truffle oil",
            "MY DAD DO THAT TOO",
            "this sounds like someone who plays a lot of RPGs where if you pick up stuff regularly you never have to buy anything from NPCs. I usually end most RPGs with a stupid amount of health potions, money etc because I ’m always like  “but what if I need them more later!! ” ",
            "@foxofninetales That ’s the true sign of friendship",
            "@hils79 But I don't ENJOY cooking, I ENJOY collecting alllllllll the spring onions!  :D  I would fill a shed with onions for you.",
            "@foxofninetales We should play Stardew together some time  \ud83d \ude02",
            "those 300 void eggs probably WOULD see a person through armageddon",
            "@pumpkinpaix No I keep like one/a handful of everything.  But this is literally just...NOT SELLING ANYTHING.  Hoarding simulator.",
            "Oh mood the ghosts of purple star ancient fruit wine still haunt me to this day  \ud83d \ude2d",
            "I DO SELL STUFF I JUST ALSO MAKE SURE I HOLD ONTO LIKE A SAFETY NET IN CASE I NEED THE ITEMS FOR QUESTS OR SOMETHING I HAVE LOTS OF MONEY OKAY RINGS",
            "All the people saying you don ’t need money in the endgame, like....have you played 1.5?   Because I ’m working towards True Perfection and just GRINDING for the millions of $$ I need to get there.   ",
            "seems to me that he's avoiding the capitalism of it all, and i gotta say, hell yeah lol"
        ]
    },
    {
        "thread": " Mario had some how become Evil ™ ️ and Nintendo decided he was bad publicity and would no longer be making or selling Mario games. ",
        "comments": [
            "this goes against marios morals",
            "As if people wouldn't be interested in evil mario/nintendo wouldn't just try and run with it",
            "This might kinda happen if Italy goes back to fascism.",
            "@evilmario666 ",
            "What if that actually happened and waluigi became nintendos new mascot lol ",
            "I mean, it's true",
            "didnt mario expire",
            "love the idea of a fictional character having character development beyond the control of their parent company",
            "Is this why they have Chris Pratt playing him in the movie?",
            "Oh well. At his place, let's hire... Huuum (Luigi: Me! Me! I'm right there!) Wario (Luigi:  whaaaAAAAAAT)",
            "@evilmario666",
            "This sounds like the kind of story SMG4 would write.",
            "@evilmario666",
            "@evilmario666 what have you done",
            "Are you implying Mario is real",
            "Mario canceled",
            "dont diss evilmario like this",
            "@evilmario666",
            "@evilmario666 "
        ]
    },
    {
        "thread": " Butterfly Soup 2 is composed primarily of  “Haha, I do that ” and then having strong feelings about it for the next six minutes. ",
        "comments": [
            "#relatable amiright fellas ",
            "Went back to collect some samples. These feel like goddamn Barnum statements if I didn't know that other people do not in fact feel like this.",
            "alright.",
            "Hang on one more",
            "If I was posting a screenshot every time I went  She just like me, she just like me fr  I would be significantly further behind in the narrative, but allow this to be an example."
        ]
    },
    {
        "thread": " choo choo charles is a refreshing indie horror game because it strikes a beautiful balance between having actual gameplay and in depth mechanics and also not taking its story seriously. too many games lean too hard into the shitpost-style game that just ends up being not fun or very interesting. choo choo charles is a shitpost mixed with actual thoughtful game design and a lot of effort into the world and npcs- and it ’s pretty cool for that. ",
        "comments": [
            "I just wish that God forsaken beast wouldn't always target me when I'm in the middle of doing a side quest 300 yards from my train",
            "PICKLES!!",
            "Need to play this game",
            "im v happy to hear this, it's been on my radar for awhile",
            "honestly I'm definitely over the whole  look how deliberately little effort I put into this  gimmick. A game can be silly and have the comedic qualities of a poorly made game without actually being poorly made. its more interesting when an earnest effort is put forth."
        ]
    },
    {
        "thread": " Post-apocalyptic video game where every single NPC is wearing  Mad Max  style, tits out, leather and chains, piercings in places you didn ’t know could be pierced wasteland chic and sporting names like Buzzsaw and Fuckface, but the actual story and gameplay is a pleasant slice-of-life farming sim and never once attempts to explain or justify why its cast of characters is Like That  – they just are.   ",
        "comments": [
            "I know it doesn't fit with the aesthetic exactly, but with  post-apocalyptic farming sim , I immediately thought of The Wandering Village, which I can definitily recommend.",
            "Q Hayashida would make this",
            "Sold, the main part I want to play fall out 4 is make a nice place for people to live in",
            "This would be an indie bestseller.",
            "It's because it's set in New Jersey.",
            "Honestly, this is how I tried to play Fallout 4, but the ghouls begged to differ on the nature of the game.",
            "I love this idea, and want to play it immediately"
        ]
    },
    {
        "thread": " The ending of Stray was beautiful but I have to admit, part of me was hoping during the entire playthrough that the second we got the cat outside, it would turn around and repeatedly meow to be let back in. ",
        "comments": [
            "SAME",
            "hey I hear it ’s moddable can someone work on this?  Or can it be DLC?  ",
            "ROFL",
            "@idiotv2 ",
            "THAT ’S WHAT I THOUGHT THE WHOLE GAME WAS ABOUT. JUST A LIL KITTY TRYING TO GO OUT ONLY TO WANNA GO RIGHT BACK INSIDE. /SRS /GEN I WAS CERTAIN THAT WAS THE POINT",
            "this made me ugly laugh"
        ]
    },
    {
        "thread": " if you think that video games shoudln ’t have adjustable difficulty and you also think that turn based video games are obsolete and bad then it seems to me like you actually just think video games shouldn ’t be for people like me who just have bad reaction times and difficulty moving in a rendered 3d space. ",
        "comments": [
            "@bookerbluedragon Wargroove is a fun turn based game with difficulty settings. It even let's you customize ones if you would just prefer to change one thing like sligtly more income",
            "Fuck your   “it ’s about skill ”. It ’s not.",
            "@siseja elaborate on that, I don't quite understand what you mean",
            "@herothroughtime that's ableist",
            "Funnily enough, turn based games are one of the genres that almost never has actual difficulty options. As a turn-based noob & a certified Autism, it made me personally despise the genre",
            "If you enjoy turn based games may I reccomend Fate Grand Order? It's a great turn based game.",
            "Hollow Knight needs difficulty options. I love the game, but I'm to the point where my lack of luck and hand-eye coordination skills are starting to hurt me. I cannot get past the demonic roly polys known as the Watcher Knights.",
            "I have decent reflexes, but still appreciate Easy Modes because real life is hard enough!",
            "I think the game should be as the developers intended, the artist's vision and all that you know? Sometimes an experience asks that you struggle for a bit, but that's all by design, artist's intention. If somethings too hard for you then just quit, no shame in it.",
            "This debate is always tough for me. Games that don't have difficulty sliders usually want to tell a story through your own perseverance.   But I also see the other side, where people simply want to have fun and enjoy the game.  Thankfully for the most difficult games on PC, there are fan-mods to make games more approachable. But I honestly do not know if there will ever be a correct answer for this. :/",
            "I have a problem with remembering sequences, so games that rely on quick memorization for one section  become almost impossible to progress from",
            "Also like … I ’m disabled. I have difficulty processing information and moving my body quickly. I also have severe chronic pain which means I can ’t move my hands a lot very quickly else they ’re in agony a while after- and this is bad enough that I need painkillers and to go lie in bed after a round of fucking Mario Party of all things. I struggle with Kirby games. Even normal difficulty games can be rage-quit level infuriating to me because I missed an imput or my pain made me unable to move my...",
            "Games should be fun, for some people it ’s fun to pass a super hard challenge and feel like they improved. But for others that same challenge is unsurmountable and they shouldn ’t be made fun of for choosing to play at an easier difficulty. And for some others it might not be unsurmountable but still tok frustrating to be fun do an easier mode makes it fun again. "
        ]
    },
    {
        "thread": " the problem with giving my cars a trans/gay pride livery in racing games is that it makes me get really competitive in multiplayer. I have to win, for my country, for honour. ",
        "comments": [
            "@kocothelegend second car in the post is a Pontiac Trans Am Firebird",
            "You should make a trans am",
            "@cass-without-the-andra said:",
            "you are realizing the power of tribalism",
            "So what I ’m hearing is it makes you play better",
            "you just gotta listen to Phantom Racer by TWRP and you're guaranteed to win every time",
            " Why is the bi car driving backwards?    Because it goes both ways! ",
            "Went and grabbed pictures of the rest of the gang:",
            "Is that …. A Trans AM?!",
            "@joriontel said:",
            "@@andmaybegayer can.. we see it?"
        ]
    },
    {
        "thread": " <b>Level 1:</b> Dating sim character has a mental breakdown when they realise that they ’re a character in a video game.  <b>Level 2:</b> Dating sim character realises that they ’re a character in a video game, and is weirdly cool with it.  <b>Level 3:</b> Dating sim character knows they ’re in a video game, but they ’re convinced that  they ’re  the human player and you ’re just a fourth-wall-aware NPC.  <b>Level 4:</b> Dating sim character successfully  proves  that they ’re the human player and you ’re just a fourth-wall-aware NPC, whereupon the perspective immediately switches so that now you ’re playing as them and your former viewpoint character is an NPC.   <b>Level 5:</b>  Dating sim character successfully  dis proves that their world is just a video game, and the game immediately ends.   ",
        "comments": [
            "Or Truman show",
            "we once tried writing a story where the dating sim character wasn ’t aware it was a game, and just thought they were in a time loop with someone who was acting slightly differently each loop",
            "dating sim game where they ’re all there as professional actors and go to hilarious lengths to avoid breaking immersion, but one of them becomes self aware that their reality OUTSIDE of the play is a game too, and we cycle back to square one",
            "Secret Bonus Point: All of these are in the same game!",
            "@raspbrrytea please"
        ]
    },
    {
        "thread": " Love to be an npc in a video game. Go to the same places at the same time every day. Only have to memorize a set number of responses to conversations. Once you ’ve exhausted all your dialogue options you can just stop talking. Now that ’s the life ",
        "comments": [
            "Raise your hand if you jusy realized you ARE an NPC...",
            "YES",
            "don't we all do this",
            "This is wild. Sounds like a nightmare to me, but I can totally appreciate it seeming heavenly to you. Hahhahah"
        ]
    },
    {
        "thread": " GLaDOS grabbing Chell  \ud83e \udd1d Bowser grabbing Luigi  \ud83e \udd1d Lady Dimitrescu grabbing Ethan Winters ",
        "comments": [
            "Insert love is love Fullmetal Alchemist meme",
            "@gobbogoo caroline and cave johnson are both white. chell is half brazilian and half japaneese, going off her real life face model.",
            "thank you so much for being polite and wanting to hear my side! i did happen to find the post i was thinking about (i think it is that one) and although it is very long, it is also a good read! it also covers your mention of the turret opera, but not Cave Johnson's part as the latest game wasn't released yet. i don't quite see how Cave teaching them is related, though that might be on my fault since i'm a bit tired today!",
            "I too am now quite interested to know if someone can share a link to this debunking. I primarily stick with that interpretation due to the turret opera before the credits, which seems undeniably to be sung by a parental figure for Chell (the lyrics referring to her as  my baby  repeatedly). Since Cave Johnson (or his AI replicate at least) canonically taught the turrets to sing, it felt like some pretty simple dots to connect.",
            "i won't reply because i don't want to involve my main on this, but there is a very good post by someone i don't remember debunking that. it still is a valid theory, but it's not cannon. ofc you can interpret the little things as evidence, but the same way i wouldn't push you to enjoy chelldos, i don't think it's right to push that interpretation as cannon. hope you can understand my view and i don't mean to offend you in any way! ",
            "A Chell/GlaDOS ship makes me deeply uncomfortable, as there's evidence in the game that Carolin was Chell's biological mother."
        ]
    },
    {
        "thread": " i ’ve been absorbing lots of apocalypse media lately and MAN i am enjoying the discovery that like. there ’s two kinds of apocalypse.   a  rotting  kind, where things kind of fall away and disappear and are quiet and hard (the walking dead, the last of us, hollow knight,  ‘in a week ’ by hozier).   and a  rising  kind where things kind of burn up and bounce back better than ever (fallout new vegas, ender ’s game, breath of the wild,  ‘ain ’t no grave ’ by johnny cash).   immaculate  ",
        "comments": [
            "Fallout new vagas is post post apocalypse the end of days was 200 years ago",
            "@vnknowncrow There ’s a manga you ’d like called Yokohama Kaidashi Kik ō that has this asthetic. It ’s about a world that ’s been mostly claimed by nature",
            "fallout???!",
            "Second one is basically:  have you tried turning it on and off again  but with society",
            "check out brawl stars, its a lot darker than you'd think bro",
            "The type that have old cities reclaimed by nature and vines and bush are always so beautiful"
        ]
    },
    {
        "thread": " 1 hour into playing Stray: Yes, I am a cat. I am a menace to society. I scratch your carpet. I knock over paint cans and leave my little paw prints everywhere.   3 hours into Stray: Why the fuck are there giant eyeballs all over the walls? ",
        "comments": [
            "Haha, this was me literally yesterday!  ",
            "we dont talkabout the sewer wer wer wers",
            "Gonna pull a Bruno on the sewers, ch àle",
            "we don't talk about the sewers",
            "me to everyone in the game: i am literally just a cat",
            "Yeah that never got explained wtf",
            "LITERALLY"
        ]
    },
    {
        "thread": " <div data-npf='{ type : poll , client_id : 43a77f62-3054-4caa-aa01-853dad55b933 , question : Best Classic Windows Game , answers :[{ client_id : 5e9516a5-6f69-4fc3-8fda-22d2b7b4596f , answer_text : Solitaire },{ client_id : eafd3894-c269-4922-83de-bffb06e73bec , answer_text : Minesweeper },{ client_id : e8753bc0-aec5-4240-b014-cbf5dfe536ac , answer_text : Hearts },{ client_id : bff47d7c-6ba9-44a4-aed5-296973d8c817 , answer_text : FreeCell },{ client_id : 2d382f4c-31ca-4590-a949-605e6fcef8ab , answer_text : Pinball (Space Cadet) },{ client_id : bd35a86d-3832-414a-977f-e14e0875876d , answer_text : Spider Solitaire },{ client_id : 1ba80639-dfe2-4aee-af33-2c8eac7e9073 , answer_text : Chess },{ client_id : 0d68356a-3f2b-49af-8eda-3e054aee0c5a , answer_text : Mahjong },{ client_id : 6ae26685-2780-4749-9057-7668914eca32 , answer_text : Purble Place },{ client_id : 157a00aa-d904-4905-b892-460884627a2c , answer_text : Inkball }], settings :{ multiple_choice :false, close_status : closed-after , expire_after :604800, source : tumblr }}' class= poll-post ><p class= poll-question >Best Classic Windows Game <a href= https://www.tumblr.com/blog/view/decorum-video-games/709882001548853248  rel= nofollow  class= poll-row > Solitaire  <a href= https://www.tumblr.com/blog/view/decorum-video-games/709882001548853248  rel= nofollow  class= poll-row > Minesweeper  <a href= https://www.tumblr.com/blog/view/decorum-video-games/709882001548853248  rel= nofollow  class= poll-row > Hearts  <a href= https://www.tumblr.com/blog/view/decorum-video-games/709882001548853248  rel= nofollow  class= poll-row > FreeCell  <a href= https://www.tumblr.com/blog/view/decorum-video-games/709882001548853248  rel= nofollow  class= poll-row > Pinball (Space Cadet)  <a href= https://www.tumblr.com/blog/view/decorum-video-games/709882001548853248  rel= nofollow  class= poll-row > Spider Solitaire  <a href= https://www.tumblr.com/blog/view/decorum-video-games/709882001548853248  rel= nofollow  class= poll-row > Chess  <a href= https://www.tumblr.com/blog/view/decorum-video-games/709882001548853248  rel= nofollow  class= poll-row > Mahjong  <a href= https://www.tumblr.com/blog/view/decorum-video-games/709882001548853248  rel= nofollow  class= poll-row > Purble Place  <a href= https://www.tumblr.com/blog/view/decorum-video-games/709882001548853248  rel= nofollow  class= poll-row > Inkball  <a href= https://www.tumblr.com/blog/view/decorum-video-games/709882001548853248  rel= nofollow  class= poll-see-results >See Results </div> ",
        "comments": [
            "Y'ALL space cadet source code here btw -> https://github.com/k4zmu2a/SpaceCadetPinball",
            "This is SkiFree erasure",
            "Vanilla extract ",
            "Bow and arrow was the best no doubt"
        ]
    },
    {
        "thread": " stop making everything multiplayer you whores i don ’t have friends  ",
        "comments": [
            "honest to god ",
            "Well not those kind of friends, my friends know I suck at multi-player cause of my butt where's the story, what's the background,  this game makes no sense, complaining ass.",
            "Also I don't have time to get good anymore, I'm tired of being dominated by players who can spend hours of their day playing your game. ",
            "I'd be more than happy to play cross play games with my followers tbh",
            "Thanks lotro  \ud83d \ude12"
        ]
    },
    {
        "thread": " The best feature of Stardew Valley is they let you kiss your husband/wife as many times a day as you wish ",
        "comments": [
            "True I love that!",
            "spending half of the day just smooching sebastian",
            "sebastian deserves all the kisses my character is capable of giving him.",
            "Agreed, Sam will be forever smothered in kisses"
        ]
    },
    {
        "thread": " currently finishing up making some holographic Glamrock chica keychains~ ",
        "comments": [
            "So cool! I love how the broken chica mouth is spikier. No matter all that cutesy plastic on the outside, it's a cold machine on the inside :)",
            "IS THIS- IS THIS HIT TUMBLR USER MoOshRamU?!  \ud83d \ude28",
            "THEY HAVE ARRIVED!",
            "they ’re almost here!!!! once I see how they look I ’ll see if I wanna put em up for sale  \ud83d \udc40 \ud83d \udc40 \ud83d \udc40",
            "<3"
        ]
    },
    {
        "thread": "  Y/n - Did you eat all the sugar powered donuts?  <span class= npf_color_monica >Ruggie - *mouth full of food*  … No</span>  Y/n - Then what ’s that on your pants  <span class= npf_color_monica >Ruggie - *Looks down at his pants* That ’s cocaine</span>  ",
        "comments": [
            "*loading nerf gun with painful bullets*",
            "He getting a lot money off that",
            "Cocaine?! Pfft- ",
            "And you were drugging without me? I'm offended, Ruggie /j",
            "Did NOT expect that ( ･ ･;)",
            "Is this from VanossGaming? I remember seeing a comic with them, but I don ’t know if that ’s the OG."
        ]
    },
    {
        "thread": " The video game Undertale states that monsters do not bleed, but instead turn to dust when they die. However, Deltarune, which is related to Undertale, has the character Susie, who is a monster, note that  “everybody bleeds ”. When questioned about this discrepancy, creator Toby Fox stated  “oh for fuck ’s sake I did it again. Damn it! I keep messing up! Why me!? ”   ",
        "comments": [
            "I honestly didn't doubt it ",
            "@jaybybyby The other monsters don ’t have bones. They have magic instead, but Sans (And Papyrus) have actual bones, and bones have marrow, which is uh, kinda like blood? And you happen to hit Sans in a place, in such a way, that red marrow blood stuff comes out.",
            "My personal headcanon is Susie is unaware monsters don't bleed. Like she legit doesn't know. We don't know how she doesn't know she just doesnt",
            "Yeah Toby wouldn't just forget something like that",
            "@goblinofstorms yea i'm aware, but just because you drink something doesn't mean it's gonna gush out of ur mouth if u get slashed in the chest, yknow?",
            "@jaybybyby sans canonically drinks ketchup",
            "@bidemoniacal that's definitely a popular theory, but it's never been confirmed. that, plus if it was ketchup then i'm pretty sure it wouldn't be pooling out of his mouth, haha ^ ^",
            "@jaybybyby i thought he was faking it with ketchup",
            "hey remember that theory that sans came from deltarune? and he's one of the only monsters (other than undyne) who bleeds in undertale? tee hee"
        ]
    },
    {
        "thread": " Rick Riordan, now ’s your chance to make your own video game where we get to be a demigod at camp half-blood and go on adventures fighting various greek monsters, and various sequels in line with the other mythologies ",
        "comments": [
            "oh my god PLEASE",
            "This has more notes than any other post I've made. I now understand warmongering.",
            "i would clock an ungodly amount of hours on the game",
            "No but like I'd play the shit out of that game",
            "Instead of whatever the fuck the y'know what was. ",
            "As long as he bases them off of the books or the tv show (I hope it ’s good) then I ’d buy it in a second.",
            "@no-more-dolls I think you just didn't know a lot of people who read those books, they were insanely popular throughout my entire middle school experience, and even now there's still tons of millions of fans. Your opinion of the books is valid to your own experience, but I'm blocking you because I don't like your vibe",
            "@no-more-dolls what  \ud83d \udc80 \ud83d \udc80 \ud83d \udc80 \ud83d \udc80 why on earth would it be inspired by Harry Potter?? Also, why would they be made based off of the movies. The books. Are right there. Plus the show is coming out soon. So. You sound like an idiot and you making yourself look stupid just made MY day a lot better",
            " ​Be the funniest guy online and create a well written, well made videogame about freeing people from oppression in a horizontal, culturally diverse society"
        ]
    },
    {
        "thread": " <figure class= tmblr-full  data-orig-height= 1353  data-orig-width= 1080 ><img src= https://64.media.tumblr.com/20cd6106d1c9483a28943a069243241e/e658aca5fe9d303b-da/s540x810/49af6961a98e3e40f1d4409df3db161e6d79ab5d.png  data-orig-height= 1353  data-orig-width= 1080 ></figure> ",
        "comments": [
            "Speak for yourself.",
            "Brian David Gilbert, we know that's you",
            "AS A WALUIGI SIMP",
            "True tbh",
            "@reservecourses ",
            "WAHH",
            "Will never not reblog  \ud83e \udd9d Waluigi",
            "Wah",
            "waluigi heritage post!!",
            "@marketa-the-art-lover danny devito Wario and William dafoe waluigi",
            "T H E",
            "True story",
            "WALUIGI HECC YE",
            "Why still no ass?",
            "YES! ITS HIM WE WANT",
            "Wario will always hold my heart with a firm grip"
        ]
    },
    {
        "thread": " Reblog this and put an indie game in the tags that you did NOT like. One that you regret spending time playing it.  Curious about what indie games have given people bad experiences.  If you don ’t have one you dislike then just tag that you don ’t have one. ",
        "comments": [
            "All Metroidvanias that are also souls like. Just send me back to my last save game like a normal game. This padding of lose all your money and go get it back is lazy and doesn't add anything to the experience.",
            "Hollow Knight was almost a great game for me, but the shade kinda ruined it for me. It kinda forces you to keep bashing your head against same challenges. Feels kinda counterintuitive to the whole point of the game being about exploration",
            "Dunno if its indie so much as its just niche, but I bought The Liar Princess and the Blind Prince on Switch cuz the art style looks nice and seemed okay from trailers. It was the first time I played a game and got genuinely pissed off cuz it controls like dogshit and the level design is bland. Hence, you look at player reviews before buying anything.",
            "I hate Hollow Knight. It was way too hard and I couldn ’t even get through the tutorial area (even tho I ’m not that bad at games) and I don ’t care for the lore or characters, they all feel bland. I much prefer Rain World in terms of gameplay, ingenuity, and lore honestly."
        ]
    },
    {
        "thread": " <figure class= tmblr-full  data-orig-height= 294  data-orig-width= 500 ><img src= https://64.media.tumblr.com/cb1e8e5db927109d69b6baded57dcbdf/949d2588303d8668-85/s540x810/117a427f891251cd9fdccddfbc19f00ff0d898aa.gif  data-orig-height= 294  data-orig-width= 500 ></figure><figure class= tmblr-full  data-orig-height= 303  data-orig-width= 468 ><img src= https://64.media.tumblr.com/488c31637162b9e185ce180a8726ea4a/949d2588303d8668-e5/s540x810/cfc51056db539ad4704bc60ba7ea83f613406592.png  data-orig-height= 303  data-orig-width= 468 ></figure> As soon as I saw Alcina do this in the new trailer I immediately thought of this.  ",
        "comments": [
            "@lullaby-of-souls oh my god I can ’t wait!!!",
            "@geocookie21 New additions to The Mercenaries, a game mode available in resident evil 8. They're adding more characters including lady D, people will be able to play with her!",
            "SHE THREW HER FUCKING CHAIR AT THEM AUSHEHDJWKWKEKSWKKSKW  \ud83d \udc80 \ud83d \udc80 \ud83d \udc80 \ud83d \udc80 \ud83d \udc80 \ud83d \udc80",
            "I need explanations!",
            "WAIT there ’s a new trailer?!?!"
        ]
    },
    {
        "thread": " <b>Testament:</b> But be careful, men aren ’t allowed to step foot in the Grove.  <b>Bridget:</b> But I ’ve been standing here for five minutes and nothing happened?  <b>Testament: </b>Strange.  - Ten Years Later -  <b>Bridget: </b>Motherfucker -     ",
        "comments": [
            "You know what, mood",
            "@guiltiest-gear ",
            "@guiltiest-gear",
            "Bridget: But I ’ve been"
        ]
    },
    {
        "thread": " The best thing in life is when you encounter a giant bell in a video game, and when you attack it, it goes  “bong ”. ",
        "comments": [
            "ok.",
            "4. Shovel that goes clang.",
            "Oooh The Creature!",
            "Of course when the bell goes  “bong ”, usually you get The Creature"
        ]
    },
    {
        "thread": "  “Buy the game to support the devs ” is such a dumb thing to say. Do you buy every game that comes out? I bet you didn ’t buy the crappy Popeye game that came out a few years ago. Better put out $40 on the new Peppa Pig game. After all, you want to support the devs right? Or literally any other good game that you didn ’t buy because you decided it wasn ’t for you. Shut up, you ’re just looking for excuses to buy the terf wizard game when you ’ve already made up your mind that you don ’t care ",
        "comments": [
            "@firelinkshrinedweller Professor fig dies in all endings, have fun spending $70 on the antisemitism simulator you swagless cunt",
            "Also correct me if I'm wrong but don't the devs also suck?",
            "Also, much like with a movie, THE DEVS ARE ALREADY PAID BRO. YOU ARE NOT GIVING THEM ANY MONEY BY SUPPORTING ANTISEMITISM WIZARD GAME. ITS GOING TO THE COMPANY AND THE TERF AUTHOR.",
            "@snoopingassusual I don't cause I can't afford it for now  \ud83d \udc80 and I also play other games so ye",
            "@kingxfmischief ye I know, and? I spoil games to myself anyway bc I keep looking at wikis and fanarts  \ud83d \ude29",
            "@goldenvelvet sure go ahead, you do you. Won ’t stop us from being mad though  ",
            "support the devs is for liddol indie studios that have been working for free. not universal studios properties.",
            "@goldenvelvet Professor Fig dies at the end.",
            "Also, isn't the lead dev like super alt right?",
            "Let's not forget it's also ~antisemetic~",
            "@fridjitzu The guy you ’re talking about is Troy Leavitt, Hogwarts Legacy ’s lead designer. He had a YouTube page active until around 2018 that he used to actively support gamergate, praise cultural appropriation (this isn ’t an exaggeration, one of the videos was quite literally called  “In Praise of Cultural Appropriation ”), defend JKR ’s anti trans propaganda, and support individuals such as John Lassester.",
            "@goldenvelvet no you're playing a Harry Potter game you fucking loser",
            "Yes, I don't care, can I play my game in peace now?",
            "I cannot stress this enough:",
            "Im not gonna let some stupid shit like that stop me from enjoying a video game. Im gonna play the shit out of it.",
            "The lead developer was a fucking gamergater, so maybe don't support the fucking devs, either?",
            "You're daft, all right  \ud83e \udd71 \ud83e \udd21 \ud83e \udd21"
        ]
    },
    {
        "thread": " <h1>My Thoughts on Hogwarts Legacy</h1> This is something that has been on my mind recently as more discourse about the topic is coming to the forefrunt of the internet. Hogwarts Legacy and, honestly, the Harry Potter franchise as a whole.  As I see things, there are 5 groups of people when it comes to  “THAT wizard game. ” <ol><li> “Hey, I don ’t want to play it because of my own personal reasons. But if you want to play it, I hope you have fun. ”</li><li> “Hey, I do want to play this game because of my own, personal reasons, but I understand that you ’re not interested. That ’s cool. ”</li><li> “This game gives money to a transphobe?! Awesome! I just bought two copies. ”</li><li> “You want to play this game for your own reasons? You ’re a transphobe piece of shit. I won ’t stop until you know you ’re a piece of shit. ”</li><li> “Harry Potter? Hogwarts Legacy? I haven ’t played video games since I lost 2 weeks of my life to Banjo Kazooie in 1998. ”</li></ol> If you fall into either category 1, 2, or 5, then right on. You ’re doing the right thing. Keep it up.  However, if you fall into either category 3 or 4, you are a fucking problem and you need to cut the shit and grow up.  Personally, I fall into category 1. I feel I have made my views on the game and franchise fairly clear. But also, I have a good friend who learned to read because of Harry Potter. I grew up with the franchise and it was a huge part of my childhood, and recognizing that I no longer want to engage in the franchise felt like a huge loss to me, and took some time to reconcile with myself. But, again, I have made that decision based on the larger franchise and not simply this one game. And, also again, these are my OWN PERSONAL REASONS. If you ’re interested, I will gladly share my thoughts in a civil manner, and only ask that you understand my thinking, not that you agree with me, or try to convince me to change my mind.  Now, to address category 3. Deep breath, here.  If you are doing anything at all because you know it will make the lives of people worse, then fuck you right to hell. Yes, this group of people also generally goes hand in hand with a specific red hat and an orange demagogue. If you find yourself in this category, get help. Go to therapy and ask about this concept called  “empathy. ”  Category 4.  I will repeat: if you are doing anything at all because you know it will make the lives of people worse, then fuck you right to hell. Setting up websites to track Twitch streamers to see who is playing Hogwarts Legacy? Going to channels and harrassing the streamers for wanting to play the game? I would argue that people in this category or worse than those in category 3 because while those in 3 as assholes, they are blowing money on something they don ’t actually care about to try triggering someone while people in this group are going out and actively attacking people for engaging something that they want to experience for, and repeat after me, THEIR OWN PERSONAL REASONS. I saw in one chat that someone mentioned they wished executions were legal because people were doing something they didn ’t like. Sounds an awful lot like some people who built some gallows outside of a notable large building in the US back in the beginning of January 2021, doesn ’t it?  Here ’s where things really boil down on Hogwarts Legacy. The game is made. It ’s done. Rowling has been paid or will be getting paid. You attacking people for enjoying the game isn ’t going to stop that. But there ’s a lot more people than just her in the mix, here. Think about all the hundreds of people who have spent YEARS working on making this game, and trying to make it the best game possible. They have also been paid and are continuing to get paid. Controversy has surrounded Hogwarts Legacy pretty much since it was announced. And it wasn ’t cancelled.  Here ’s where I see things going with the game: it is the outrage of the day. Somewhat surprisingly, the outrage of Hogwarts Legacy ’s release is overshadowing the much more recent information about Justin Roiland. People will continue to be upset by this game for a while, and eventually that will fade, as all outrage does.  But you know what won ’t pass? The hurt caused by people to other people over this game. Your friend, who you disagree with about the game, sitting in their home, playing the game, is not going to hurt you. Streamer playing the game and you don ’t want to watch it? THEN FUCKING DON ’T. Full stop. For fuck ’s sake, people were buying subs to a twitch stream just so they could continue harrassing the streamers after they made the chat sub-only. Fuck you. Grow up. And like I told the people in group 3, get therapy.  Actually, everyone should go to therapy, but that isn ’t the point of this.  Here ’s what my point of view boils down to: let people enjoy what they enjoy and stop shitting on things just because people enjoy them. Yes, the situation here is more complex and nuanced than that, but every situation is. And if any part of this rambling has made you angry or upset for any reason, I ’d like you to think about why that is. I am not advocating for people to play the game or not play the game. Honestly, I just couldn ’t give a fuck what you want to play in the privacy of your own home. I just want people to be better. Treat people better. Be better people. Recognize that everyone on this planet is, at the very least, deserving of being treated like a person and deserving of love. And if you can ’t understand that fact, did you really understand Harry Potter at all?  ",
        "comments": [
            "The game isn't even that great, it's just very mid-tier at best.",
            "Proud member of the numer 4 category  ♥ ️  ✌ ️ \ud83d \ude17 \ud83e \udd70 ✨ all TERF's should die in a fire",
            "Conservative-phobic much? And why should people think about the other people all time? Why can't they be selfish?",
            "I'm on 2 as I want to play the game but am cool if people don't want to play it but everyone else is acting in tomfoolery.",
            "So … since I just finished the game, I could finally go search art about it, theories, rooms of requirements, news on it, easter eggs, you know nice stuff that can be found along with spoilers (hence the waiting until I finished it) and so whenever I want something that involves creativity and gets lots of points of view I can ’t usually get to by myself I come to tumblr, because it rarely dissapoints to provide what I like.",
            "@nekru there's a million better ways to educate people on something instead of going straight to  kill yourself . No wonder why most people aren't interested in being educated when you get death threats for not even having an opinion let alone having one. This whole situation is disgusting and incredibly immature.",
            "Thank you  \ud83d \ude4f ",
            "@blazwura i just told my friend, that fosters puppies, that i bought a game about punching kittens and gave money to a person that kills puppies. now they're mad at me, i'm a victim.",
            "Like, if you know that 4 of those 60 dollars is definitely gonna get funneled from you, through jkr, and directly into the pocket of lobbies trying to criminalize LGBTQI+ people, and you knowingly do it anyway, that a choice you made and it DOES speak to your values. Live with it, or make better choices. But stop hiding behind your nostalgia.",
            "Category 6, the one everyone likes to pretend doesn't exist because it isn't a strawman, is thus;  I'm going to hold your hand and calmly walk you through the real-world consequences of where you put your money. Now, you can't pretend to be uninformed. What you choose to do from there is your own choice, but because I know that you now have that context and knowledge, the choice you make is going to color my perception of you. ",
            "I bet most of the left is in what I'm gonna call 4.1, where supporting the game and its transphobic and antisemitic beneficiaries is bad, but not nearly bad enough to warrant death/suicide threats (nothing's bad enough for that). I'd be willing to bet most of those are trolls trying to make us look bad. On the other hand, I've seen people blow valid criticism out of proportion and call it harrassment.",
            "I hate the HP game but please, please, I beg of you to not send death threats and wish harm on people who're genuinely clueless about the whole ordeal. Don't just immediately jump into their dms or cm sections and send hateful words.",
            "One of the select sensible arguments about this insane squabble.",
            "@euphorichistory goblins were created as an antisemitic caricature. most media with goblins nowadays stays away from that trope but in hp the goblins control the banks and the star of david was on the floor in the bank in the movie",
            "None of this is happening in a vacuum. You don't get to try to be Sweden so you can enjoy your game, and now is not the time to mind your own business while you watch hate crimes unfolding all around you.  Let people enjoy things  does not extend to allowing bigotry and propaganda.",
            "And hell, that's just the trans genocide! As I understand it, this game is openly and blatantly antisemitic in a way that cannot be an accident. And Jewish communities have seen this before. They are also facing unprecedented hatred recently.",
            "My point is: in this current environment, there is no neutral stance on trans rights, and since JKR has repeatedly made clear that to support her franchise is to support her transphobic ideals, I don't believe there's a morally neutral ground here. You're either openly, actively decrying and fighting a genocide, or you are an accomplice in it.",
            "There was a time when this would have been relevant, good advice even, and that time was the Obama administration. We are less than 72 hours out from a trans person murdered and then deadnamed by UK news; 300+bills are circulating in the US that restrict or outlaw gender affirming care. Protesters under 18 are told to stay home or CPS will persecute their parents.",
            "Couldn ’t agree more. What has always been an issue in our world is people responding to those who think/feel/look differently to us with hatred and violence. As much as someone might feel justified in their hate, every single person believes as deeply as they do that their hate is righteous. Harassing people online helps no one, JKR didn ’t invent the belief in biological sex, and she didn ’t invent goblins. Transphobia and antisemitism exists even in a world where HP doesn ’t.",
            "Funny how there's no option for constructive criticism of a game that is anti semitic. You don't have to want to kill the people who want to play to talk about why its bad to play. Save your friends from anti semitic propaganda. No one is immune to propaganda.",
            "People really will say that you can ’t buy it cuz all the money goes directly to a trans phobe (it doesn ’t) which puts trans people at risk of suicide, and then send you death threats. Because you ’re playing a video game. A literal video game.",
            "@billnyeisnotmyfather what antisemitic undertones?",
            "Does group four include the people telling me to kill myself and that I ’m a Nazi? (which is just great because I ’m Jewish …)",
            "I'm in group two, I hate it that people are attacking other people it's okay if you don't like a game or a media made by people you don't like don't guilt or threats people",
            "Fig dies :) yw",
            "Thank you for this. I am only playing the game because my trans friend bought it and when he finished let me borrow it. I would ’ve never bought it myself but he did because Harry Potter got him through a dark time in his life. That doesn ’t make him a bad person. And me playing a game that I got for free for the same reasons does not make me a bad person. Instead of spending the $60 I gave that money to a trans friendly non profit, yet people who don ’t know us think we are awful people.",
            "Yeah, basically all of this right here.",
            "If people honestly are saying  “good ” at the thought of someone committing suicide after being harassed and told to kill themselves over playing this game then they are horrible people as well who lack empathy. Full stop. It ’s not okay. I ’m not a Harry Potter fan, I ’m not buying or supporting the game, but holy shit it ’s not that hard to not send death threats or tell people, likely CHILDREN to kill themselves.",
            "Honestly the amount of people I see saying those who play the game should kill themselves and sending death threats horrifies me just as much as the blatant antisemitism. Like the anti-hp crowd was (and still is) making really good points and helping bring awareness but idk it ’s like suddenly all poisonous, hateful, extreme and toxic. No, no it ’s not okay to tell anyone to kill themselves. Because there are some people that very well just might. And the fact that some people would say  “good ”??",
            "Category 6: I don't want to play this game, I also don't want others to play this game because of its content and message which is why I support providing information for other people WITHOUT bullying 12 y/os who bought the game because they thought it looked cool"
        ]
    },
    {
        "thread": " can i please pause time for like 16 hours, catch up on video games and self care, and then maybe unpause … but not before a quick snack on paused time ",
        "comments": [
            "Please me too",
            " “magically have enough money to get the required permits and licenses for contractor work? ” You don ’t have $50-$200 to spare for an electrician/plumber exam? A JD requiring an engineering degree to  “ring up snacks ”? I ’m not sure how you landed where you did, but I think you ’re overstating the difficulty of getting a trades career, or the prestige of college required to work in software.   My uni has a >90% acceptance rate  ",
            "This is not personal bitterness, this is recognizing that the system is broken, that it's flawed, that it needs to be fixed. The economy does not have feelings, so don't worry about hurting the economy's feelings by accepting that maybe it's not the fault of individual workers, and maybe it is something that can be fixed if only you quit making excuses for it, like you would for an abusive parent.",
            "Well, just start streaming on Twitch or magically have enough money to get the required permits and licenses for contractor work? Yeah, it's called blowing people off and patting yourself on the back while pretending everyone else is dumb, lazy, or both.",
            "It's like back in Texas at one point - the clerk at the gas station only got the job because he had an engineering degree, which has nothing to do with being able to ring up a bag of Doritos. Degrees aren't about skill, they are about proving how much you can afford for the prestige of the 'right school'. Medical school for doctors? Great. Engineering degree required to ring up snacks? Bullshit requirement.",
            "It's been studied plenty - the one factor most closely linked to a person's economic success is, yes, location, but in the sense that you start in a very wealthy location, lucky enough to be born into a family that can afford to send you to private schools and the right university after that, and allowing you to meet all the right people who can help get you into the right job for the time while the rest of us are gatekept out.",
            "@picaroon123 I've actually lived and worked all over the world, it's not just 'bitter because of geographical location', unless you want to think of it in the way it really is, economic failures in the 'geographical location' that is this entire planet. Understand, if you found success doing what you do, fine, but the assumption that if it worked for you, it works for everyone is ridiculous.",
            "@windblownsand XD it seems like you're bitter from a long series of failures due to the economy where you live, and maybe you lacking an undergrad degree. I'm not the  one person  to become a successful contractor. I've worked in software contracting for nearly a decade, and always alongside other contractors, mostly imported tech visa workers. The jobs I've mentioned are great and in demand. Sorry about your local economy, it helps to find a geography needing your skill",
            "and none of which pay enough to cover gas. Your arguments MIGHT have had merit in the 1940's, but things have changed since then. The gig economy is garbage and does not work for the vast majority of people. How nice it must be to be the one guy who made it when millions of others didn't, even when they may well have been just as skilled as you, if not more skilled.",
            "communications antennas, running all the electrical systems, and programming phones and servers gets me nowhere. It's a desert so open ocean navigation (another job I spent years doing) is not going to cut it anywhere. Neither would flying aircraft (yet another job of mine). In fact, the only contracting jobs here are house cleaning (generally under the table and at a huge net loss, no benefits OR paycheck OR W-2) or making a road trip to and from a major city everyday..",
            "@picaroon123 Perhaps you can't fathom that most jobs are in retail/food service and they are called 'unskilled' - that's what I'm talking about for skills. As far as UX, I managed to get one person to hire me - not a business, a person, and the only person is town other than myself who isn't deathly afraid of the internet and that POC are allowed on it too. As for other contracting, well the phone company is a family business, so my years of experience setting up ...",
            "@windblownsand skill issue ;p. I find there is much more w-2 employment in web than there is freelancing. Good private contractor jobs are like various repairman/construction jobs, hvac, electrician, plumber, and other services you can sell directly to people, instead of businesses",
            "znack is on tumblr"
        ]
    },
    {
        "thread": " A scene from God of War: Ragnarok got leaked of an early boss fight where you fight Thor and it ’s absolutely jaw dropping and amazing but there ’s this one particular bit where you fucking DIE in a quick time event and go to the continue screen like usual, except midway through the  “loading ” you suddenly hear Thor faintly saying  “I say when we ’re done ” or something like that and then the game suddenly starts again because Thor USES HIS HAMMER AND LIGHTNING AS A DEFIBRILLATOR TO RESTART YOUR HEART SO HE CAN KEEP BEATING YOUR ASS, and if that is not one of the most batshit awesome ways of toying with the medium of video games that I have ever seen I don ’t know what is. ",
        "comments": [
            "I screamed when this happened LMAOOO",
            "Somebody's copying undertale's homework",
            "I was watching my dad play when he got to that part and we both lost our minds",
            "I managed to play through the game blind so when I tell you I lost my motherfucking mind at that part, I mean it",
            "Fourth wall breaks my beloved"
        ]
    },
    {
        "thread": " <figure class= tmblr-full  data-orig-height= 537  data-orig-width= 1038 ><img src= https://64.media.tumblr.com/939103a70c087fbd81dde759ff6c168c/33d987680da3b3dd-ab/s540x810/65ea79f79523332cb0461d94e52e03f28809ce58.png  data-orig-height= 537  data-orig-width= 1038 ></figure> Cuphead good    ",
        "comments": [
            "Good, very good",
            "this is why cuphead is one of my favorite games",
            "did someone say delayed",
            "I know of multiple news outlets that would make this sound like a bad thing"
        ]
    },
    {
        "thread": "  If we are calling people who genuinely are excited to play a game that is part of an extremely influential novel from their childhood  “terfs ” or  “transphobic ” because of the author, alright, okay. Then these I guess also have to be true.   <span class= npf_color_joey >1.  If you have ever owned an apple product, you support sweat shop labour </span>  <span class= npf_color_joey >2. If you are a fan of bloodborne, call of cthulu, or have read/purchased/enjoyed anything by H.P. Lovecraft, you are racist</span>  <span class= npf_color_joey >3. If you enjoy Shakespear, and have anything in regards to him, you support pedophilia </span>  <span class= npf_color_joey >4. If you ever supported the far cry series, you support workplace abuse.</span>   <span class= npf_color_joey >5. Ever purchased anything made/owned by Disney? Not only are you racist, you ’re homohobic too!</span>  Before you say  ‘it is different. ’ No, it ’s not.   Now if you excuse me, I ’m going to enjoy being a wizard while still supporting my friends and family in the transgender community.   ",
        "comments": [
            "@dorimefroggy  \ud83d \udc4c",
            "Wow..... You're absolutely disgusting excuse of a human :(((",
            "thanks for proving you don't care about jews <3 rookwood curses anne and fig dies no matter what",
            " \ud83d \udc46 \ud83d \udc46 \ud83d \udc46",
            "man i didn ’t realize anyone here was still this fucking stupid",
            "none of this makes any sense but enjoy your nazi simulator i guess. just don ’t be surprised when your friends and family in the transgender community don ’t think of you as an ally because you chose a $60 nostalgia bait over their well-being.",
            "@meldy-arts have fun !! it ’s a great game!",
            "Seriously, just let me enjoy the game in peace ",
            "@courseinbrainsurgery Or all of yall can just stop assuming things about people yall have never met before; I guess that would be too difficult, idk",
            "It had to be said!",
            "@100jewels-between-teeth -game, so im not surprised that people would assume most people supporting the came and jkr.. are terfs. ive seen lots of terf blogs doing it",
            "@100jewels-between-teeth and not only that but the game includes a character... who owns slaves?? and it also includes antisemitism. im not saying anyone who plays without knowing its bad is a horrible person, but if they play knowingly i think that crosses the line. jks actions are actively hurting people in the now, and needs to be stopped somehow. and somehow could be...stop playing and buying the game. also most terfs repost and talk about how they love this-",
            "@100jewels-between-teeth this is old, but why the fuck do you just pull shit out of your ass. what you said is like the twitter thing that was like  i like pancakes   OH SO YOU HATE WAFFLES? . nobody is trying to call you or your friends specifically terfs, transphobes, or nazis. everyone is just pointing out how its weird that youre actively supporting and giving money to a transphobe, who is giving money to organizations that want transphobic laws put in place.",
            "@100jewels-between-teeth some people obviously don't know what fun means",
            "Goodness the game is fun  \ud83d \udc95",
            "@guineapigfan and if said cis people don't want queer people dead then they shouldn't be dumping their money into a direct pipeline of funding anti-trans movements to a known transphobe and racist anti-semite. Even trans people are doing it bc yall can't let go of some dumbfuck 30yr old wizard books and will find any possible way to justify it. You can't separate the art from the artist while said artist lives and continues to profit off of their art. Find a better book",
            "@guineapigfan you can literally look up the dude who headed the game for a majority of its development and you'll be lead to a neo-nazi youtube channel. The Jewish coding of the goblins was entirely intentional, right down to the Shofar, it's a borderline photocopy whether you like it or not. The Goblins are a long oppressed race rebelling against their oppressors and the only  good  ones are the ones who bend the knee and accept their fate as a second class race.",
            "@guineapigfan it's blood libel. No matter if actual blood sacrifice doesn't take place.",
            "@guineapigfan however organisations who get cis people who have nostalgia for Potter merch and stuff's money want to kill trans and non-binary people tho.",
            "@guineapigfan if it isn't Shofar, then why it mentions 1612 in its description and also has a very specific non-kosher cheese shoved into it?",
            "@guineapigfan kidnapping a child is the most basic form of blood libel",
            "@sparklypinktutu1 lmao you have no argumentation to disprove the literal first point that shows up on their wikipedia page.",
            "@clearancecreedwatersurvival Not a Nazi Wizard, plenty of goblins oppose the villain, he is willing to kill innocent people, There is 0 blood libel, the horn is not a Shofur, they simply do not represent Jews outside of what you claim they represent",
            "@ryn-city That describes none of the game developers.  And the cis people buying the game don't want people killed either.",
            "@guineapigfan or her.",
            "@homoer0tic There is no blood libel. the Goblins have no interest in killing the protagonist to use his blood for anything. They need him because of his ability to see ancient magic.",
            "@",
            "@",
            "@hoardsrobotslikeadragon non-tangible @",
            "@roobztoonz uhm... Disney actually donated to anti-gay politicians in exchange for tax-free status (Thanks America)",
            "@sparklypinktutu1 well, LGB alliance is labelled as a hate group for a reason. Also they actively want to ban psychological and medical care for trans people overall, so your argument doesn't hold up. Also Sex and Gender are two different things. Yes, sex is observable reality, but it's as deciving as Earth's flatness as seen from the ground when it comes to much complex, non-tangible gender",
            "@jp707jp while not directly involved with HL, Joanne has wrote a decent chunk of Wizarding World. Death of the Author doesn't apply when the author in question is breathing and actively involved in the propety in question (from adding new thing to royalties)",
            "Disney and Apple don ’t donate millions of dollars to legislators that wanna kill trans people",
            "@hoardsrobotslikeadragon lgb alliance isn ’t a hate group, it ’s literally just a group just for same sex attracted people. Same sex attracted trans ppl like a trans man with a girlfriend are still included by them. Sex is observable material reality and the basis of sex based oppression and persecution",
            "@hoardsrobotslikeadragon ye",
            "@hoardsrobotslikeadragon tell me one good reason why you hate wizarding world but that it has nothing to do with JKR",
            "@jp707jp Okay. And I have many reasons why I hate Wizarding World and I could write the entire essay or two why if I had time. But I guess your maracas made out of your skull and shrivelled up neurons could barely grasp on how hateful messages Joanne has embedded into the core of Potter books are.",
            "@hoardsrobotslikeadragon listen I have a really good reason why I love HP that I don't want to I write here in the comments, because of that I will defend it to the death. I don't know if you're empty head can understand that",
            "@100jewels-between-teeth thirsting over generic white boy with no personality or depth no.1494?",
            "@leopard-skin-pillbox-hat-ok uhm... or maybe some people want to tell you that you shouldn't funnel your money through funny wizard game to actual hate groups, because they want to live without the fear of oppresion and dying",
            "@jp707jp neat, but it doesn't change the fact that your skull is so empty that you cannot coprehend the idea of critical thinking about the media you consume",
            "@100jewels-between-teeth well I can drag you back into this paper shredder and explain how public domain works (besides other capitalism things) to your smaller than peanut brain",
            "@hoardsrobotslikeadragon I never said it's my favorite game I just like to play it  if you need to know my favorite games are Witchbrook, Witcher 3, Animal crossing, Cult of the Lamb.... etc",
            "@jp707jp fearful of the truth that your fav game is nothing more than generic AAA garbage that is way too expensive for its contence and it also funds actual hate groups?"
        ]
    },
    {
        "thread": " hey (with the intentions of playing video games together) ",
        "comments": [
            "Ok but seriously … ",
            "@lazzydwarf ",
            "Asks politely for a chance to play?",
            " \ud83d \udc49 \ud83c \udffb \ud83d \udc48 \ud83c \udffb ",
            "@bustymarvelfan1 hey",
            "me n @scarletscoven",
            "What do you play?",
            "Hj",
            "@villainsnest"
        ]
    },
    {
        "thread": " Everybody wants to call out late 1990s/early 2000s cartoons for being responsible for every kink under the sun, but I feel like we ’re giving late 1990s/early 2000s action-platformer video games a free pass for their intense preoccupation with villains with big, stinky, worryingly well-rendered feet. ",
        "comments": [
            "@escherenigma There is a boss fight in DK64 where you shrink down really small, sneak into the baddie's shoe, and fight his toes.",
            "Sorry, guess I didn't stare at the villain's feet enough to notice.",
            "...Okay, question #2: What was the trend here, and how do the given examples illustrate it? I never got far into Crash and never played the other two.",
            "Never finished a Banjo, but I don't recall which Crash villain this could possibly be about. Ripper Roo???? Maybe???",
            "Iirc there was something about I think Elden Ring having to drop or change a bunch of bosses cuz they kept being designed with very explicitly bare feet. Tho I wouldn ’t be surprised if there were other situations adjacent to that lol.",
            "Seeing this post broke the seals on all of the wards that were preventing me from remembering the part of the dk64 King K Rool fight where tiny kong goes into his shoe to attack his toes",
            "Banjo-Kazooie isn't fair because Gruntilda becomes hot on the game-over screen.",
            "I was mostly surprised upon getting to the last sentence of the post to see that this wasn't a post about inflation.",
            "Oh yeah, THAT part of DK 64 lmao that was weird",
            "@princepossum17 If you grew up playing Minecraft, you're probably too young to have been around for the era in question regardless of your choice of video games.",
            "so glad I grew up playing minecraft",
            "Didn ’t one of the from software developers want to have a boss that would stomp on you with giant bare feet or something? Also aren ’t there also Quentin Tarantino movies and that guy ’s weird thing with feet? ",
            "imo those cartoons weren't exactly responsible for the kinks, but perhaps some were subintentionally popularizing them?",
            "a bunch of  ‘em have vore levels too",
            " What the fuck are you talking about  like, Donkey Kong 64? Crash Bandicoot? Banjo-Kazooie? This was not an obscure trend, y'all.",
            "Replies have NOT played Crash Bandicoot and Banjo Kazooie",
            "Ok so king k rool in dk64... Uh... Who else?",
            "People asking for examples have never looked at 90% of Nintendo's back catalogue.",
            "how do I ask for examples without it seeming like I'm into that",
            "Yeah this is gonna need a follow up post cuz aside from a bit of dialogue from Hooktail from Paper Mario I don't remember anything like that at all",
            "What the fuck are you talking about",
            "This is easily my #1 blog for patterns I'm glad I didn't notice as a child. ",
            "@kayinnasaki",
            "vinyl goddess from mars is the only reason i have made my peace with latex"
        ]
    },
    {
        "thread": " I hate that  “I asked the plants, but the plants do not remember. The plants asked the rocks, but the rocks do not recall ” is from Jak and Daxter and not a multi-volume epic. I wish I could fucking  read  video games. I wish I could take a game to work in book form and each event would be written in a writer ’s perfect voice that I ’m in love with. I wish I could borrow Stray from the library and crack it open to read about how the cat ’s little steps echoed in the big empty street and city and world ",
        "comments": [
            "They do video game novelization.",
            "Ikr same I really got into reading thr last 3 years and really wish tjere was more of this There are a couple of rewrites that i found on ao3 of jak and daxter some of them are  \ud83d \udc4c but are unfinished (they are being written tho if i recall correctly)",
            "Omfg same",
            "I want to read a novelization of the lost legacy so fucking bad."
        ]
    },
    {
        "thread": " I just had a moment of video game unreality because I wasn ’t aware that the developer had put out two nearly identical games two years apart with the main visible difference being the protagonist ’s gender, and now I ’m trying to imagine the reaction if a high-profile title actually did what I initially  thought  had happened. Just straight up change the protagonist ’s gender in an otherwise-minor patch a couple of years after releasing the game, don ’t mention it in the patch notes, and adamantly refuse to acknowledge it if anyone asks. ",
        "comments": [
            "@pointlessprism that is a fun game but doesn't meet the brief. It adds new elements. It's not a reskin of an existing Mario game.",
            "@foolsmask Super Princess Peach",
            "@ladydanger420 metatranstextual",
            "That would be hilarious. Nintendo should do that with a Mario game so you play as Peach rescuing the plumber brothers.",
            "Harvest Moon for Girl is the only example that comes to mind.",
            "Harvest Moon???",
            "games that are about nier",
            "Does pokemon crystal count?",
            "Reminds me of the weird group think thing where some lays chip bags changed colors",
            "Metatextually trans",
            "I'm with others on asking what these games are, if only to slake some curiosity",
            "metroid if the initial release was like 30 years later",
            "Not quite the same thing, but fun fact!",
            "Which game op",
            "they came out good for them"
        ]
    },
    {
        "thread": " <div data-npf='{ type : poll , client_id : 7246144d-d701-4aa2-b094-8feede48c86f , question : What age did you get into gaming? , answers :[{ client_id : f5b4e47c-333a-4af9-a29e-1cf279f1deea , answer_text : 3-10 },{ client_id : 85959c8f-062d-4534-be1e-4b71ba41ed14 , answer_text : 11-20 },{ client_id : c4a24045-23a8-4266-a896-0cd5f7925d64 , answer_text : 21-30 },{ client_id : 5971c5eb-2cbe-44ba-80b9-d46fb57487ef , answer_text : 31-40 },{ client_id : c96f3ab5-fba0-4b18-9c40-f91356a39525 , answer_text : 41-50 },{ client_id : d935fb39-4cb2-46d5-b205-833c8fcedbf5 , answer_text : 51-60+ }], settings :{ multiple_choice :false, close_status : closed-after , expire_after :604800, source : tumblr }}' class= poll-post ><p class= poll-question >What age did you get into gaming? <a href= https://www.tumblr.com/blog/view/decorum-video-games/709881737696755712  rel= nofollow  class= poll-row > 3-10  <a href= https://www.tumblr.com/blog/view/decorum-video-games/709881737696755712  rel= nofollow  class= poll-row > 11-20  <a href= https://www.tumblr.com/blog/view/decorum-video-games/709881737696755712  rel= nofollow  class= poll-row > 21-30  <a href= https://www.tumblr.com/blog/view/decorum-video-games/709881737696755712  rel= nofollow  class= poll-row > 31-40  <a href= https://www.tumblr.com/blog/view/decorum-video-games/709881737696755712  rel= nofollow  class= poll-row > 41-50  <a href= https://www.tumblr.com/blog/view/decorum-video-games/709881737696755712  rel= nofollow  class= poll-row > 51-60+  <a href= https://www.tumblr.com/blog/view/decorum-video-games/709881737696755712  rel= nofollow  class= poll-see-results >See Results </div> Put in the tags the first game that got you into gaming  ",
        "comments": [
            "i learned how to use a computer so i could quit the game my mom would set me up with (busytown) and launch the game i saw my dad playing instead, which was unreal tournament 1. i mostly sat around in facing worlds sniping at bots",
            "I can't remember if it was earthbound or Pokemon silver. One of those two",
            "wheres the under 3 option",
            "Call of Duty and Medal of Honor when I was 5"
        ]
    },
    {
        "thread": " <div data-npf='{ type : poll , client_id : bc3740d0-cfd4-4337-9998-6365624d9eaa , question : Which Animal Crossing is your favorite? , answers :[{ client_id : e3cfec62-62a6-46c8-b75e-74d03cdb1aef , answer_text :  \ud83c \udf24 ️ New Horizons },{ client_id : 50f0823e-e5f4-4297-8a32-9c77ffedefa0 , answer_text :  \ud83c \udf40 New Leaf },{ client_id : 5355a136-a24a-4952-bf1c-4025455ae9b2 , answer_text :  \ud83d \ude8c City Folk },{ client_id : 703151c6-9484-4e82-a978-3c14bb5e3d88 , answer_text :  \ud83c \udf0e Wild World }], settings :{ multiple_choice :false, close_status : closed-after , expire_after :604800, source : tumblr }}' class= poll-post ><p class= poll-question >Which Animal Crossing is your favorite? <a href= https://www.tumblr.com/blog/view/decorum-video-games/709881726915264512  rel= nofollow  class= poll-row >  \ud83c \udf24 ️ New Horizons  <a href= https://www.tumblr.com/blog/view/decorum-video-games/709881726915264512  rel= nofollow  class= poll-row >  \ud83c \udf40 New Leaf  <a href= https://www.tumblr.com/blog/view/decorum-video-games/709881726915264512  rel= nofollow  class= poll-row >  \ud83d \ude8c City Folk  <a href= https://www.tumblr.com/blog/view/decorum-video-games/709881726915264512  rel= nofollow  class= poll-row >  \ud83c \udf0e Wild World  <a href= https://www.tumblr.com/blog/view/decorum-video-games/709881726915264512  rel= nofollow  class= poll-see-results >See Results </div><div class= npf_row ><figure class= tmblr-full  data-tumblr-attribution= nintendo-stuff:8JRMQ8VZHZrvVQnUA0AwdQ:Zm417o2WdfO_q  data-orig-height= 278  data-orig-width= 500 ><img src= https://64.media.tumblr.com/5ba7a225855141b22d7020e8e8ba5c56/8606b18444493b65-91/s640x960/085a1bd6df38aaf07f145ffa586abb1600d27829.gif  data-orig-height= 278  data-orig-width= 500  srcset= https://64.media.tumblr.com/5ba7a225855141b22d7020e8e8ba5c56/8606b18444493b65-91/s75x75_c1/384ccd2410fb1540c29b9044a3c698f238910fa7.gif 75w, https://64.media.tumblr.com/5ba7a225855141b22d7020e8e8ba5c56/8606b18444493b65-91/s100x200/97e829f6e4cf6d0d64579bdffab3593dc2eb053b.gif 100w, https://64.media.tumblr.com/5ba7a225855141b22d7020e8e8ba5c56/8606b18444493b65-91/s250x400/d1c186f6320bd123931a55566e7021d587fea39f.gif 250w, https://64.media.tumblr.com/5ba7a225855141b22d7020e8e8ba5c56/8606b18444493b65-91/s400x600/111e3ef6a60c11fd91f59fc2f0ba9799494583c0.gif 400w, https://64.media.tumblr.com/5ba7a225855141b22d7020e8e8ba5c56/8606b18444493b65-91/s500x750/402fb3a9d8a5f277ee192e79306c86e2848f83eb.gif 500w  sizes= (max-width: 500px) 100vw, 500px ></figure></div> ",
        "comments": [
            "new leaf was my first but theres just so much more creative freedom in new horizons",
            "where's gamecube op? that was the one i played as a kid. i was too young to understand what i was supposed to do, but it was fun to do virtually nothing. as much as i like the only other version i played (new horizons), gc was definetly superior in that you're just some guy.",
            "definitely new leaf. new horizons just didnt have that animal crossing charme :(",
            "none I'm not a fan of this franchise",
            "Mine is the original gamecube one! Population Growing! c:",
            "the perfect animal crossing is new leaf gameplay and music + new horizons design mechanics and graphics",
            "new horizon has a lot of nice building elements and ways to be creative but new leaf has much more depth to its gameplay that makes me wish new horizons received more love from nintendo",
            "I want to take them all and combine the best parts",
            "this is gamecube erasure",
            "gamecube erasure  \ud83d \ude2d"
        ]
    },
    {
        "thread": " Metroidvania where mechanical progression consists entirely of a series of extremely powerful mobility upgrades which affect all forms of movement, can ’t be turned off once acquired, and have increasingly inconvenient interactions with each other, thereby gradually transforming the game into a frustration platformer. ",
        "comments": [
            "Hollow Knight but F A S T",
            "If you crouch during a dash, you will do a ball roll, that acts sort of like a rolling boulder, that won ’t stop until you hit a wall. Alternatively, if you hit a combo of 10, you will do a victory pose and be awarded 3000 pts. Unfortunately, you ’ve got spiderclimb, which makes all walls and ceilings climbable surfaces as long as you have and maintain enough speed. Good luck!",
            "Alternatively, the way to beat the final boss is to, through some puzzle mechanism, put your upgrades into them. Their movement becomes increasingly frustrating to both of you until you reach default and just walk out while they are now trapped. ",
            "I've been playing Dandara and that's kind of how it works so far",
            "@tamagowhen Knock yourself out.",
            "This actually sounds like it could be successful.",
            "really wanna make this, is it ok for me to take from your ideas??",
            "Once you get past the escape sequence, you have to face the boss again, except all your upgrades have been turned off (insert evil boss gloating here).  You proceed to curb stomp them.",
            "yes exactly",
            "Fair enough.  \ud83e \udd23",
            "Shinespark-type speedboost that activates too quickly.",
            "#of course then comes the obligatory post final boss escape sequence#with the timer being diegetically justified by the fact that the boss is trying to catch you",
            "The final boss has several big glowing weak points that are completely impossible to actually hit owing to how weird your movement is at that point in the game, but the trick is that you don't actually need to fight it; unlike all previous bosses, the arena doesn't lock you in, so you can just, like, leave.",
            "@newthinkerer I mean, people actually play frustration platformers ,so presumably it's fun for *somebody*.",
            "That doesn't sound fun at all",
            "Instant shinespark, all jumps are charged moon jumps",
            "this sounds like it would make a very fun speedrun; figuring out the optimal route through the upgrades to cobble together something entirely unintended yet completely functional from a subset of them which then gets you into somewhere you shouldn't be for another 5 hours from now",
            "[Image ID: the original tags for the above post, which read as follows: #concepts #gaming #video games #metroidvanias #each upgrade does the classic 'room where you can't get out the way you came in bit' #except the reason you can't get out the way you came in is that your upgraded movement is too awkward to navigate that route anymore.  End ID.]",
            "I just had the thought of getting a double jump and a super dash that are both triggered by hitting the jump button twice. (So once you reach the peak of your double jump you fly forwards infinitely till you hit a wall/kill plain)",
            "you have a regular run button at first, like mario. but later you get a dash. it will get you killed very often"
        ]
    }
]